export const LOCATION_TRAITS = [
    "灰烬覆盖的", "迷人的", "黑色的", "受祝福的", "枯萎的", "血腥的", "沸腾的", "明亮的", "破碎的", "埋藏的",
    "燃烧的", "烧焦的", "坍塌的", "颜色(参照特定表)", "爬行的", "深红的", "摇摇欲坠的", "水晶般的", "被诅咒的", "黑暗的",
    "死寂的", "荒凉的", "令人迷向的", "神圣的", "厄运的", "回响的", "怪异的", "效果(参照特定表)", "古老的", "怪诞的",
    "元素(参照特定表)", "无尽的", "肮脏的", "被淹的", "禁忌的", "被遗忘的", "冰封的", "鬼魂出没的", "闪闪发光的", "阴沉的",
    "冷酷的", "闹鬼的", "隐藏的", "神圣的(与24同)", "潮湿的", "地狱般的", "泛滥的", "锯齿状的", "迷宫般的", "活生生的",
    "令人厌恶的", "机械的", "雾蒙蒙的", "低语的", "神秘的", "渗出的", "(植被)蔓生的", "危险的", "石化的", "幽灵般的",
    "相位移动的", "原始的", "品质(参照特定表)", "饱受蹂躏的", "贪婪的", "不安的", "受尊敬的", "房间主题(参照特定表)", "野蛮的", "灼热的",
    "尖叫的", "阴影笼罩的", "变化的，移动的", "颤抖的", "笼罩的", "寂静的", "歌唱的", "险恶的", "下沉的", "沉睡的",
    "声音(参照特定表)", "石质的", "沉没的", "被沼泽吞噬的", "蜂拥的", "闷热的", "可怕的", "质感(参照特定表)", "长满荆棘的", "雷鸣般的",
    "扭曲的", "不宁的", "被破坏的", "广阔的", "注视的", "耳语的", "多风的", "枯萎的", "奇妙的", "蠕动的"
];

export const EXPLORATION_EVENTS = [
    "警报", "动物叫声", "幻影", "苏醒，觉醒", "战斗", "祝福", "血腥味", "天花板移动", "仪式", "城市事件(参照特定表)",
    "清洁", "苍蝇云团", "战斗声", "建造", "水晶生长", "诅咒", "死者复生", "腐烂气味", "巡逻减少", "幻觉(参照特定表)",
    "装置启动", "灾难(参照特定表)", "门关闭", "门开启", "排水", "地下城旋转", "地下城滑动", "地下城倾斜", "尘埃云", "地震",
    "元素流动(参照特定表)", "(火山)爆发", "挖掘", "阵营同盟", "阵营休战", "阵营战争", "宴会", "火灾", "易燃气体", "洪水",
    "地板移动", "雾", "食物气味", "觅食", "冰冻", "砂砾流", "孵化", "炎热", "潮湿", "狩猎",
    "熏香", "巡逻加强", "入侵", "熔岩流", "泄漏", "液体声", "机械声", "粪肥气味", "怪物气味", "怪物叫声",
    "泥石流", "音乐", "筑巢", "新阵营出现", "新怪物出现", "新房间出现", "油流", "通道关闭", "通道开启", "瘟疫",
    "位面重叠", "植物开花", "植物生长", "植物枯萎", "修复", "裂隙开启", "房间旋转", "房间滑动", "房间倾斜", "房间被填满",
    "房间重组", "沙流", "气味(参照特定表)", "歌声", "沉睡", "烟雾", "声音(参照特定表)", "静电荷", "召唤", "完全寂静",
    "陷阱效果(参照特定表)", "陷阱重置", "害虫群", "说话声", "墙壁合拢", "墙壁移动", "墙壁变宽", "水流", "风", "敬拜，礼拜"
];

export const DUNGEON_ROOMS = [
    "炼金实验室", "酒窖", "植物园", "射箭场", "竞技场", "军械库(护甲)", "兵工厂(武器)", "美术馆", "画室", "会见厅",
    "鸟舍", "舞厅", "宴会厅", "兵营", "浴室", "寝室", "酿酒厂", "建筑物(参照特定表)", "地下墓穴", "洞穴",
    "牢房", "小教堂", "裂缝，深渊", "教堂", "蓄水池", "衣帽间", "音乐厅", "咒术室", "法庭", "庭院",
    "火葬场", "地穴", "餐厅", "占卜室", "宿舍", "地下城(参照特定表)", "更衣室", "防腐处理室", "角斗坑", "裂隙",
    "锻造厂", "喷泉室", "画廊", "游戏室", "花园", "门房", "大厅", "警卫室", "走廊", "医务室",
    "杂物间", "狗窝", "厨房", "实验室", "巢穴", "食品储藏室", "厕所", "图书馆", "休息室", "地图室",
    "迷宫", "机械装置(参照特定表)", "冥想室", "动物园", "食堂", "鹰棚", "博物馆", "音乐室", "育儿室", "天文台",
    "食品柜", "客厅", "深坑", "毒药室", "水池", "监狱", "档案室", "地点(参照特定表)", "沙龙", "缮写室",
    "洗碗间", "雕塑展览馆", "商店", "神龛", "屠宰场", "吸烟室", "马厩", "储藏室", "构筑物(参照特定表)", "书房",
    "挂毯室", "剧院", "王座室", "酷刑室", "训练大厅", "宝库", "战利品陈列室", "保险库", "工作坑", "作坊，工坊"
];

export const ROOM_DETAILS = [
    "酒精", "壁龛", "祭坛", "原型(参照特定表)", "阳台", "栏杆", "浅浮雕", "浴缸", "床铺", "骸骨",
    "书籍(参照特定表)", "火盆", "碎玻璃", "橱柜", "笼子", "地毯", "雕刻", "大锅", "链条", "粉笔印记",
    "枝形吊灯", "箱子", "衣物(参照特定表)", "棺材", "钱币", "坍塌的天花板", "坍塌的地板", "坍塌的墙壁", "狭小爬行空间", "摇摇欲坠的天花板",
    "摇摇欲坠的地板", "摇摇欲坠的墙壁", "帷幕", "高台", "碗碟", "陈列柜", "食用升降机", "升降机", "布料(参照特定表)", "壁炉",
    "流水", "食物(参照特定表)", "喷泉", "真菌", "涂鸦", "危险(参照特定表)", "熏香", "原料(参照特定表)", "乐器", "提灯",
    "地图", "材料(参照特定表)", "机械装置(参照特定表)", "信息，留言", "矿车", "镜子", "杂项物品(参照特定表)", "怪物(参照特定表)", "壁画", "巢穴",
    "绘画", "长凳", "柱子", "管道", "水池", "升降闸门", "药水(参照特定表)", "垃圾堆", "修复痕迹", "树根",
    "碎石堆", "气味(参照特定表)", "竖井", "架子", "迹象(参照特定表)", "骷髅", "烟雾", "沙发", "声音(参照特定表)", "窥视孔",
    "楼梯", "钟乳石", "雕像", "火炉", "街道细节(参照特定表)", "符号(参照特定表)", "桌子", "挂毯", "厚厚的灰尘", "王座",
    "厕所", "工具(参照特定表)", "火把", "酷刑装置", "训练假人", "暗门", "宝藏(参照特定表)", "藤蔓", "衣柜", "武器(参照特定表)"
];
