export const LOCATION_TRAITS = [
    "灰烬覆盖的", "迷人的", "黑色的", "受祝福的", "枯萎的", "血腥的", "沸腾的", "明亮的", "破碎的", "埋藏的",
    "燃烧的", "烧焦的", "坍塌的", "颜色(参照特定表)", "爬行的", "深红的", "摇摇欲坠的", "水晶般的", "被诅咒的", "黑暗的",
    "死寂的", "荒凉的", "令人迷向的", "神圣的", "厄运的", "回响的", "怪异的", "效果(参照特定表)", "古老的", "怪诞的",
    "元素(参照特定表)", "无尽的", "肮脏的", "被淹的", "禁忌的", "被遗忘的", "冰封的", "鬼魂出没的", "闪闪发光的", "阴沉的",
    "冷酷的", "闹鬼的", "隐藏的", "神圣的(与24同)", "潮湿的", "地狱般的", "泛滥的", "锯齿状的", "迷宫般的", "活生生的",
    "令人厌恶的", "机械的", "雾蒙蒙的", "低语的", "神秘的", "渗出的", "(植被)蔓生的", "危险的", "石化的", "幽灵般的",
    "相位移动的", "原始的", "品质(参照特定表)", "饱受蹂躏的", "贪婪的", "不安的", "受尊敬的", "房间主题(参照特定表)", "野蛮的", "灼热的",
    "尖叫的", "阴影笼罩的", "变化的，移动的", "颤抖的", "笼罩的", "寂静的", "歌唱的", "险恶的", "下沉的", "沉睡的",
    "声音(参照特定表)", "石质的", "沉没的", "被沼泽吞噬的", "蜂拥的", "闷热的", "可怕的", "质感(参照特定表)", "长满荆棘的", "雷鸣般的",
    "扭曲的", "不宁的", "被破坏的", "广阔的", "注视的", "耳语的", "多风的", "枯萎的", "奇妙的", "蠕动的"
];

export const EXPLORATION_EVENTS = [
    "警报", "动物叫声", "幻影", "苏醒，觉醒", "战斗", "祝福", "血腥味", "天花板移动", "仪式", "城市事件(参照特定表)",
    "清洁", "苍蝇云团", "战斗声", "建造", "水晶生长", "诅咒", "死者复生", "腐烂气味", "巡逻减少", "幻觉(参照特定表)",
    "装置启动", "灾难(参照特定表)", "门关闭", "门开启", "排水", "地下城旋转", "地下城滑动", "地下城倾斜", "尘埃云", "地震",
    "元素流动(参照特定表)", "(火山)爆发", "挖掘", "阵营同盟", "阵营休战", "阵营战争", "宴会", "火灾", "易燃气体", "洪水",
    "地板移动", "雾", "食物气味", "觅食", "冰冻", "砂砾流", "孵化", "炎热", "潮湿", "狩猎",
    "熏香", "巡逻加强", "入侵", "熔岩流", "泄漏", "液体声", "机械声", "粪肥气味", "怪物气味", "怪物叫声",
    "泥石流", "音乐", "筑巢", "新阵营出现", "新怪物出现", "新房间出现", "油流", "通道关闭", "通道开启", "瘟疫",
    "位面重叠", "植物开花", "植物生长", "植物枯萎", "修复", "裂隙开启", "房间旋转", "房间滑动", "房间倾斜", "房间被填满",
    "房间重组", "沙流", "气味(参照特定表)", "歌声", "沉睡", "烟雾", "声音(参照特定表)", "静电荷", "召唤", "完全寂静",
    "陷阱效果(参照特定表)", "陷阱重置", "害虫群", "说话声", "墙壁合拢", "墙壁移动", "墙壁变宽", "水流", "风", "敬拜，礼拜"
];

export const DUNGEON_ROOMS = [
    "炼金实验室", "酒窖", "植物园", "射箭场", "竞技场", "军械库(护甲)", "兵工厂(武器)", "美术馆", "画室", "会见厅",
    "鸟舍", "舞厅", "宴会厅", "兵营", "浴室", "寝室", "酿酒厂", "建筑物(参照特定表)", "地下墓穴", "洞穴",
    "牢房", "小教堂", "裂缝，深渊", "教堂", "蓄水池", "衣帽间", "音乐厅", "咒术室", "法庭", "庭院",
    "火葬场", "地穴", "餐厅", "占卜室", "宿舍", "地下城(参照特定表)", "更衣室", "防腐处理室", "角斗坑", "裂隙",
    "锻造厂", "喷泉室", "画廊", "游戏室", "花园", "门房", "大厅", "警卫室", "走廊", "医务室",
    "杂物间", "狗窝", "厨房", "实验室", "巢穴", "食品储藏室", "厕所", "图书馆", "休息室", "地图室",
    "迷宫", "机械装置(参照特定表)", "冥想室", "动物园", "食堂", "鹰棚", "博物馆", "音乐室", "育儿室", "天文台",
    "食品柜", "客厅", "深坑", "毒药室", "水池", "监狱", "档案室", "地点(参照特定表)", "沙龙", "缮写室",
    "洗碗间", "雕塑展览馆", "商店", "神龛", "屠宰场", "吸烟室", "马厩", "储藏室", "构筑物(参照特定表)", "书房",
    "挂毯室", "剧院", "王座室", "酷刑室", "训练大厅", "宝库", "战利品陈列室", "保险库", "工作坑", "作坊，工坊"
];

export const ROOM_DETAILS = [
    "酒精", "壁龛", "祭坛", "原型(参照特定表)", "阳台", "栏杆", "浅浮雕", "浴缸", "床铺", "骸骨",
    "书籍(参照特定表)", "火盆", "碎玻璃", "橱柜", "笼子", "地毯", "雕刻", "大锅", "链条", "粉笔印记",
    "枝形吊灯", "箱子", "衣物(参照特定表)", "棺材", "钱币", "坍塌的天花板", "坍塌的地板", "坍塌的墙壁", "狭小爬行空间", "摇摇欲坠的天花板",
    "摇摇欲坠的地板", "摇摇欲坠的墙壁", "帷幕", "高台", "碗碟", "陈列柜", "食用升降机", "升降机", "布料(参照特定表)", "壁炉",
    "流水", "食物(参照特定表)", "喷泉", "真菌", "涂鸦", "危险(参照特定表)", "熏香", "原料(参照特定表)", "乐器", "提灯",
    "地图", "材料(参照特定表)", "机械装置(参照特定表)", "信息，留言", "矿车", "镜子", "杂项物品(参照特定表)", "怪物(参照特定表)", "壁画", "巢穴",
    "绘画", "长凳", "柱子", "管道", "水池", "升降闸门", "药水(参照特定表)", "垃圾堆", "修复痕迹", "树根",
    "碎石堆", "气味(参照特定表)", "竖井", "架子", "迹象(参照特定表)", "骷髅", "烟雾", "沙发", "声音(参照特定表)", "窥视孔",
    "楼梯", "钟乳石", "雕像", "火炉", "街道细节(参照特定表)", "符号(参照特定表)", "桌子", "挂毯", "厚厚的灰尘", "王座",
    "厕所", "工具(参照特定表)", "火把", "酷刑装置", "训练假人", "暗门", "宝藏(参照特定表)", "藤蔓", "衣柜", "武器(参照特定表)"
];

export const ROOM_THEMES = [
    "活动(参照特定表)", "祝福", "失明", "血液", "骸骨", "书籍(参照特定表)", "大脑", "混乱", "城市主题(参照特定表)", "坍塌",
    "战斗", "尸体", "腐败", "创造", "犯罪活动", "乌鸦", "邪教", "诅咒", "死亡", "腐朽",
    "疾病", "占卜", "领域(参照特定表)", "龙", "溺水", "眼睛", "效果(参照特定表)", "元素(参照特定表)", "面容", "宴飨",
    "雾", "通路，门户", "鬼魂", "诸神", "手", "圣战", "饥饿", "狩猎", "囚禁", "入侵",
    "发明", "反转，颠倒", "审判", "光明", "锁", "疯狂", "魔法学派(参照特定表)", "记忆", "镜子", "物品特性(参照特定表)",
    "嘴巴", "音乐", "突变", "异乡人", "盛会", "偏执", "地点特性(参照特定表)", "毒药", "牧师", "预言",
    "老鼠", "难民", "不安的死者", "复仇", "财富", "仪式", "敌对阵营", "献祭", "野蛮狂怒", "秘密知识",
    "蛇", "阴影", "头骨", "奴役", "粘液", "烟雾", "歌曲", "灵魂", "蜘蛛", "静滞",
    "雕像", "召唤", "生存", "牙齿", "触手", "考验与试炼", "月亮", "星辰", "太阳", "荆棘",
    "诡计", "暴政", "吸血鬼", "水", "野蛮生长", "酒", "冬季", "狼", "蠕虫", "狂热"
];

export const DUNGEON_TYPES = [
    "炼金实验室", "动物巢穴", "水族馆", "植物园", "档案馆", "竞技场", "军械库(护甲)", "美术馆", "疯人院", "自动机器",
    "鸟舍", "银行", "浴室", "建筑物(参照特定表)", "地堡", "赌场", "城堡", "地下墓穴", "大教堂", "洞穴系统",
    "蓄水池", "城市", "钟楼", "尸体", "法庭", "犯罪巢穴", "珍奇柜", "水坝", "死亡陷阱", "仓库，补给站",
    "挖掘场", "宿舍", "阵营藏身处", "工厂", "时尚展馆", "宴会厅", "锻造厂", "垃圾坑", "门径，入口", "公会大厅",
    "历史展馆", "医院", "旅馆", "冰洞", "虫巢", "乐器(巨型/魔法)", "狗窝", "厨房", "迷宫", "食品储藏室",
    "熔岩管道", "图书馆", "活体地下城", "锁", "宅邸", "市场", "陵墓", "纪念碑", "动物园", "磨坊",
    "矿井", "修道院", "怪物展览馆", "怪物实验室", "怪物巢穴", "博物馆", "蘑菇森林", "巢穴", "育儿室", "天文台",
    "天象仪", "宫殿", "监狱", "赛道", "房间(参照特定表)", "圣所", "雕塑展览馆", "下水道", "船", "筒仓",
    "屠宰场", "马厩", "据点", "构筑物(参照特定表)", "召唤地点", "寺庙", "试验场", "剧院", "主题公园", "陵墓(与57同)",
    "塔楼", "训练场", "宝库", "树木(巨型/特殊)", "仓库", "迷宫般的通道", "自来水厂", "武器展览馆", "酒窖", "工作坑"
];

export const TRAP_EFFECTS = [
    "吸收", "加速", "排列", "吸引", "平衡", "敲打", "弯曲", "阻挡", "吹动", "钝击",
    "煮沸", "燃烧", "爆裂", "掩埋", "捕捉", "冲锋", "窒息", "关闭", "压缩", "收缩",
    "倒计时", "碾压", "致聋", "传送", "探索变动(参照特定表)", "干燥", "分割", "吸干", "掉落", "效果(参照特定表)",
    "扩张", "延伸", "填充", "拍打", "漂浮", "聚焦", "冰冻", "抓取", "硬化", "钩住",
    "固定", "囚禁", "充气", "插入", "发射", "举起", "锁定", "松开", "降低", "打开",
    "摆动", "穿刺", "夹捏", "指向", "戳刺", "拉动", "推动", "反射", "释放", "移除",
    "排斥", "滚动", "舀取", "打乱", "切断", "摇晃", "电击", "射击", "粉碎", "筛选",
    "下沉", "猛砍", "滑动", "减速", "窒息(覆盖)", "浸泡", "软化", "旋转", "挤压", "染色",
    "粘贴", "拉伸", "摆荡", "缠绕", "撕裂", "收紧", "倾斜", "倾倒", "传送(与24同)", "绊倒",
    "转动", "扭曲", "使失衡", "掘出", "解锁", "称重", "鞭打", "缠绕(与84同)", "摇晃(不稳定)", "包裹"
];

export const HAZARDS = [
    "加速", "酸液", "警报", "酒精", "动物(参照特定表)", "箭矢", "自动机器", "雪崩", "斧头", "蝙蝠",
    "致盲光", "沸腾的焦油", "沸水", "寒冷", "鳄鱼", "原油", "黑暗", "震耳噪音", "幻觉(参照特定表)", "探索变动(参照特定表)",
    "灾难(参照特定表)", "疾病", "钻头", "灰尘", "效果(参照特定表)", "电流", "元素(参照特定表)", "坠落", "恐惧气体", "火焰",
    "火蚁", "力场", "玻璃碎片", "胶水", "油脂", "断头台", "锤子", "高温", "重气体", "钩子",
    "热金属", "热蜡", "氢气", "冰块", "墨水", "灯油", "熔岩", "圆木", "磁铁", "水银",
    "金属颚", "霉菌", "熔融黄金", "熔融铁", "怪物(参照特定表)", "泥浆", "突变(参照特定表)", "钉子", "针", "绞索",
    "软泥怪", "磷", "钢琴线", "食人鱼", "毒药", "毒气", "流沙", "辐射", "狂暴气体", "老鼠",
    "沙子", "锯子", "剪刀", "污水", "碎纸机", "催眠气体", "烟雾", "蛇", "矛", "法术(参照特定表)",
    "蜘蛛", "尖刺", "孢子", "蒸汽", "恶臭", "石块", "硫磺", "剑", "焦油", "稀薄空气",
    "荆棘", "旅行变动(参照特定表)", "真空", "藤蔓", "黄蜂", "水", "武器(参照特定表)", "网", "湿水泥", "风"
];

export const MECHANISMS = [
    "气泵", "滚珠轴承", "桶", "栏杆", "篮子", "横梁", "铃铛", "风箱", "传送带", "弓(机械部件)",
    "刹车", "桶(与3同)", "按钮", "缆绳", "笼子", "绞盘", "车轮", "投石器", "链条拉动装置", "链条(与19部分同)",
    "通道，沟渠", "爪钩", "钟表", "铜线", "走廊", "起重机", "生物(作为装置一部分)", "弩(机械部件)", "幕布", "圆柱体",
    "刻度盘", "门", "排水管", "鼓轮", "风扇", "浮标", "齿轮", "格栅", "仓鼠轮", "手轮",
    "钩子(与危险表40同)", "沙漏", "氢气罐", "千斤顶", "梯子", "闩锁", "透镜", "升降台", "光束", "锁",
    "镜子", "网", "桨叶", "钟摆", "销钉", "管道", "坑", "平台", "塞子", "气动装置",
    "杆", "升降闸门", "压力板", "滑轮", "齿轮齿条", "轨道", "斜坡", "棘轮", "储水池", "房间",
    "秤", "剪式升降台", "螺丝", "铲斗", "竖井", "滑道", "水闸", "球体", "弹簧", "楼梯",
    "开关", "坦克履带", "龙头", "螺纹", "工具(参照特定表)", "暗门", "踏车", "扳机", "绊索", "滑车",
    "真空泵", "阀门", "虎钳", "墙壁(可移动的)", "水泵", "水车", "楔子", "配重", "绞车(与16同)", "风车"
];
