export const TRAVEL_HAZARDS = [
    "1 遭遇：队伍遭遇一次事件，通常从为该地区或地形类型设计的表格中掷骰决定。GM决定遭遇的反应、活动、距离及是否被突袭。",
    "2 疲劳：每个队员受到1点伤害，除非他们在下一个值夜班次休息（恶劣天气或困难地形中伤害可能更高）。休息时忽略此结果。",
    "3 耗尽：为每个易腐物品（口粮、怪物部件等）掷一个d6。若掷出1，则该物品已变质。",
    "4 旅行变动：天气变化或当地事件开始（见下方天气与变动表）。",
    "5 迹象：玩家发现附近有随机遭遇的迹象。下一次在该六角格中掷出遭遇时，必遇到该生物；或揭示一个隐藏事物线索。",
    "6 无事：没有效果。"
];

export const WEATHER_CONDITIONS_2D6 = [
    "2 雷暴，冬季则为暴风雪",
    "3 大雨，冬季则为大雪", "3 大雨，冬季则为大雪",
    "4 反季节寒冷", "4 反季节寒冷", "4 反季节寒冷",
    "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪",
    "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽",
    "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和",
    "8 反季节温暖", "8 反季节温暖", "8 反季节温暖", "8 反季节温暖", "8 反季节温暖",
    "9 有风", "9 有风", "9 有风", "9 有风",
    "10 反季节炎热", "10 反季节炎热", "10 反季节炎热",
    "11 强风", "11 强风",
    "12 春季冰雹，夏季潮湿，秋季有雾，冬季霜冻"
];

export const TRAVEL_EVENTS = [
    "酸雨", "动物迁徙", "铁砧云", "火山灰云", "火山灰雨", "极光", "雪崩", "球状闪电", "鸟类迁徙", "黑风暴",
    "暴风雪", "血月", "灌木丛火灾", "城市事件", "骤雨", "寒潮", "寒冷天气", "天空异色", "幻觉(参照特定表)", "浓雾",
    "灾难(参照特定表)", "下击暴流", "毛毛雨", "尘卷风", "沙尘暴", "地震", "特殊效果之雨", "雷暴雨", "元素之雨", "火旋风",
    "萤火虫", "火灾风暴", "山洪", "洪水", "积云", "雾", "食物之雨", "森林火灾", "冰雾", "冻雨",
    "草原火灾", "哈布风暴", "冰雹", "雹暴", "霾", "热闪电", "热浪", "大雨", "炎热天气", "热风",
    "潮湿", "飓风", "冰暴", "虫群", "山体滑坡", "熔岩流", "微风", "月食", "流星雨", "海市蜃楼",
    "薄雾", "雾雨", "季风", "泥石流", "群鸟乱舞", "北极光", "阴天", "行星连珠", "花粉云", "火山碎屑流",
    "鱼雨", "蛙雨", "蠕虫雨", "彩虹", "盐暴", "沙暴", "气味(参照特定表)", "阵雨", "烟雾", "浓烟",
    "日食", "声音(参照特定表)", "兽群奔逃", "星胶", "蒸汽魔", "强风", "硫磺云", "沼泽鬼火", "味觉之雨", "质感之雨",
    "雷暴", "龙卷风", "地震(微弱)", "火山弹", "暖雨", "暖风", "水龙卷", "武器之雨", "风暴", "卷云"
];

export const ENVIRONMENT_SIGNS = [
    "争论声", "灰烬", "胆汁", "刃痕", "血迹", "血迹足迹", "骨头碎片", "骸骨", "钻孔", "(鸟兽的)凉亭",
    "折断的树枝", "危险(参照特定表)", "洞穴", "尸体", "被啃食的植物", "爪痕", "衣物(参照特定表)", "茧", "压扁的草", "水坝",
    "图表", "挖掘声", "粪便", "粪便气味", "蛋", "蛋壳", "元素踪迹(参照特定表)", "布料碎片(参照特定表)", "羽毛", "打斗声",
    "火坑", "旗帜", "逃窜的猎物", "食物储藏处", "食物气味", "食物残渣(参照特定表)", "脚印", "果核", "毛皮", "涂鸦",
    "坟墓", "蜂巢", "猎人", "受伤的猎物", "兽穴", "兽穴气味", "信件", "交配地", "机械装置(参照特定表)", "标记(在树上等)",
    "粪堆", "杂项物品(参照特定表)", "蜕下的壳", "土堆", "粘液", "泥泞足迹", "麝香气味", "巢穴", "筑巢声", "后代",
    "器官(参照特定表)", "(猛禽的)食余残渣", "信息素", "光滑的表面", "花粉", "仪式残留物", "唾液", "鳞片", "气味(参照特定表)", "烧焦痕迹",
    "阴影", "蜕皮", "贝壳", "信号声", "歌声", "粘液痕迹", "声音(参照特定表)", "潜行声", "剥落的树皮", "符号",
    "牙印", "质感踪迹(参照特定表)", "工具(参照特定表)", "小径", "陷阱", "垃圾", "树干抓痕", "地道", "尿液", "尿骚味",
    "说话声", "(动物的)泥坑", "警告气味", "警告声", "警告标记", "蜡", "武器(参照特定表)", "蛛网", "翅膀", "朝拜者"
];

export const ENVIRONMENT_LOCATIONS = [
    "火山灰地", "恶地", "竹林", "玄武岩柱", "海湾", "海滩", "悬崖，峭壁", "泥沼", "乱石区", "小溪",
    "孤山", "破火山口", "峡谷", "洞穴", "悬崖", "云雾林", "针叶林", "小树林", "峭壁", "火山口",
    "小河", "渡口", "水晶", "落叶林", "三角洲", "沙丘", "沙尘区", "元素场域(参照特定表)", "倒塌的树木", "沼泽地",
    "峡湾", "漫滩", "喷气孔", "间歇泉", "冰川", "峡谷(深)", "岩洞", "树林", "冲沟", "石南荒原",
    "高地", "空洞", "岩柱", "温泉", "冰盖", "丛林", "小丘", "潟湖", "巢穴(与13,58同)", "湖泊",
    "熔岩区", "熔岩管", "湖泊，峡湾", "红树林沼泽", "沼泽", "草地", "平顶山", "泥潭", "荒野", "山脉",
    "泥滩", "绿洲", "油苗", "山口", "牧场", "石化森林", "深坑", "高原", "池塘", "大草原",
    "流沙", "雨林", "急流", "沟壑", "山脊", "河流", "河岸地区", "岩崩处", "盐滩", "盐沼",
    "热带稀树草原", "碎石坡", "灌木丛", "落水洞", "泉水", "干草原", "溪流", "硫磺泉", "沼泽(泛指)", "泰加林",
    "焦油坑", "灌木丛(茂密)", "苔原", "山谷", "火山平原", "火山", "荒地", "瀑布", "湿地", "漩涡"
];

export const ENVIRONMENT_STRUCTURES = [
    "修道院", "祭坛", "圆形剧场", "引水渠", "档案馆", "疯人院", "土匪营地", "谷仓", "战场", "钟楼",
    "篝火", "(天然的)凉亭", "火盆", "建筑物(参照特定表)", "石冢", "车辙小道", "城堡", "地下墓穴", "小教堂", "城市",
    "蓄水池", "女修道院", "十字路口", "水坝", "土路", "石棚墓", "地下城(参照特定表)", "农场", "渡轮", "节日场所",
    "渔夫小屋", "浅滩", "林务员小屋", "堡垒", "绞刑架", "花园", "要塞", "大门", "吊笼", "墓地",
    "村庄", "(巨石)石阵", "隐居处", "藏身处", "公路", "猎人营地", "狩猎小屋", "旅店(参照特定表)", "要塞(与34,37同)", "图书馆",
    "灯塔", "伐木营地", "庄园", "市场", "纪念碑", "磨坊", "矿井", "修道院(与1同)", "独石柱", "纪念性建筑",
    "骡道", "方尖碑", "果园", "前哨站", "铺砌道路", "围栏，畜栏", "朝圣者营地", "柱子", "港口", "监狱",
    "金字塔", "难民营", "道路", "房间(参照特定表)", "废墟", "牧羊人小屋", "神龛", "信号塔", "马厩", "雕像",
    "石桥", "石圈", "勘测员营地", "酒馆", "寺庙", "收费站", "陵墓", "塔楼", "城镇", "商队营地",
    "小径", "陷阱(参照特定表)", "村庄(与41同)", "墙壁", "瞭望塔", "水磨坊", "水井", "风车", "巫师塔", "木桥"
];
