export const TRAVEL_HAZARDS = [
    "1 遭遇：队伍遭遇一次事件，通常从为该地区或地形类型设计的表格中掷骰决定。GM决定遭遇的反应、活动、距离及是否被突袭。",
    "2 疲劳：每个队员受到1点伤害，除非他们在下一个值夜班次休息（恶劣天气或困难地形中伤害可能更高）。休息时忽略此结果。",
    "3 耗尽：为每个易腐物品（口粮、怪物部件等）掷一个d6。若掷出1，则该物品已变质。",
    "4 旅行变动：天气变化或当地事件开始（见下方天气与变动表）。",
    "5 迹象：玩家发现附近有随机遭遇的迹象。下一次在该六角格中掷出遭遇时，必遇到该生物；或揭示一个隐藏事物线索。",
    "6 无事：没有效果。"
];

export const WEATHER_CONDITIONS_2D6 = [
    "2 雷暴，冬季则为暴风雪",
    "3 大雨，冬季则为大雪", "3 大雨，冬季则为大雪",
    "4 反季节寒冷", "4 反季节寒冷", "4 反季节寒冷",
    "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪",
    "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽",
    "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和",
    "8 反季节温暖", "8 反季节温暖", "8 反季节温暖", "8 反季节温暖", "8 反季节温暖",
    "9 有风", "9 有风", "9 有风", "9 有风",
    "10 反季节炎热", "10 反季节炎热", "10 反季节炎热",
    "11 强风", "11 强风",
    "12 春季冰雹，夏季潮湿，秋季有雾，冬季霜冻"
];

export const TRAVEL_EVENTS = [
    "酸雨", "动物迁徙", "铁砧云", "火山灰云", "火山灰雨", "极光", "雪崩", "球状闪电", "鸟类迁徙", "黑风暴",
    "暴风雪", "血月", "灌木丛火灾", "城市事件", "骤雨", "寒潮", "寒冷天气", "天空异色", "幻觉(参照特定表)", "浓雾",
    "灾难(参照特定表)", "下击暴流", "毛毛雨", "尘卷风", "沙尘暴", "地震", "特殊效果之雨", "雷暴雨", "元素之雨", "火旋风",
    "萤火虫", "火灾风暴", "山洪", "洪水", "积云", "雾", "食物之雨", "森林火灾", "冰雾", "冻雨",
    "草原火灾", "哈布风暴", "冰雹", "雹暴", "霾", "热闪电", "热浪", "大雨", "炎热天气", "热风",
    "潮湿", "飓风", "冰暴", "虫群", "山体滑坡", "熔岩流", "微风", "月食", "流星雨", "海市蜃楼",
    "薄雾", "雾雨", "季风", "泥石流", "群鸟乱舞", "北极光", "阴天", "行星连珠", "花粉云", "火山碎屑流",
    "鱼雨", "蛙雨", "蠕虫雨", "彩虹", "盐暴", "沙暴", "气味(参照特定表)", "阵雨", "烟雾", "浓烟",
    "日食", "声音(参照特定表)", "兽群奔逃", "星胶", "蒸汽魔", "强风", "硫磺云", "沼泽鬼火", "味觉之雨", "质感之雨",
    "雷暴", "龙卷风", "地震(微弱)", "火山弹", "暖雨", "暖风", "水龙卷", "武器之雨", "风暴", "卷云"
];
