export const TRAVEL_HAZARDS = [
    "1 遭遇：队伍遭遇一次事件，通常从为该地区或地形类型设计的表格中掷骰决定。GM决定遭遇的反应、活动、距离及是否被突袭。",
    "2 疲劳：每个队员受到1点伤害，除非他们在下一个值夜班次休息（恶劣天气或困难地形中伤害可能更高）。休息时忽略此结果。",
    "3 耗尽：为每个易腐物品（口粮、怪物部件等）掷一个d6。若掷出1，则该物品已变质。",
    "4 旅行变动：天气变化或当地事件开始（见下方天气与变动表）。",
    "5 迹象：玩家发现附近有随机遭遇的迹象。下一次在该六角格中掷出遭遇时，必遇到该生物；或揭示一个隐藏事物线索。",
    "6 无事：没有效果。"
];

export const WEATHER_CONDITIONS_2D6 = [
    "2 雷暴，冬季则为暴风雪",
    "3 大雨，冬季则为大雪", "3 大雨，冬季则为大雪",
    "4 反季节寒冷", "4 反季节寒冷", "4 反季节寒冷",
    "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪", "5 小雨，冬季则为小雪",
    "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽", "6 反季节凉爽",
    "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和", "7 反季节温和",
    "8 反季节温暖", "8 反季节温暖", "8 反季节温暖", "8 反季节温暖", "8 反季节温暖",
    "9 有风", "9 有风", "9 有风", "9 有风",
    "10 反季节炎热", "10 反季节炎热", "10 反季节炎热",
    "11 强风", "11 强风",
    "12 春季冰雹，夏季潮湿，秋季有雾，冬季霜冻"
];

export const TRAVEL_EVENTS = [
    "酸雨", "动物迁徙", "铁砧云", "火山灰云", "火山灰雨", "极光", "雪崩", "球状闪电", "鸟类迁徙", "黑风暴",
    "暴风雪", "血月", "灌木丛火灾", "城市事件", "骤雨", "寒潮", "寒冷天气", "天空异色", "幻觉(参照特定表)", "浓雾",
    "灾难(参照特定表)", "下击暴流", "毛毛雨", "尘卷风", "沙尘暴", "地震", "特殊效果之雨", "雷暴雨", "元素之雨", "火旋风",
    "萤火虫", "火灾风暴", "山洪", "洪水", "积云", "雾", "食物之雨", "森林火灾", "冰雾", "冻雨",
    "草原火灾", "哈布风暴", "冰雹", "雹暴", "霾", "热闪电", "热浪", "大雨", "炎热天气", "热风",
    "潮湿", "飓风", "冰暴", "虫群", "山体滑坡", "熔岩流", "微风", "月食", "流星雨", "海市蜃楼",
    "薄雾", "雾雨", "季风", "泥石流", "群鸟乱舞", "北极光", "阴天", "行星连珠", "花粉云", "火山碎屑流",
    "鱼雨", "蛙雨", "蠕虫雨", "彩虹", "盐暴", "沙暴", "气味(参照特定表)", "阵雨", "烟雾", "浓烟",
    "日食", "声音(参照特定表)", "兽群奔逃", "星胶", "蒸汽魔", "强风", "硫磺云", "沼泽鬼火", "味觉之雨", "质感之雨",
    "雷暴", "龙卷风", "地震(微弱)", "火山弹", "暖雨", "暖风", "水龙卷", "武器之雨", "风暴", "卷云"
];

export const ENVIRONMENT_SIGNS = [
    "争论声", "灰烬", "胆汁", "刃痕", "血迹", "血迹足迹", "骨头碎片", "骸骨", "钻孔", "(鸟兽的)凉亭",
    "折断的树枝", "危险(参照特定表)", "洞穴", "尸体", "被啃食的植物", "爪痕", "衣物(参照特定表)", "茧", "压扁的草", "水坝",
    "图表", "挖掘声", "粪便", "粪便气味", "蛋", "蛋壳", "元素踪迹(参照特定表)", "布料碎片(参照特定表)", "羽毛", "打斗声",
    "火坑", "旗帜", "逃窜的猎物", "食物储藏处", "食物气味", "食物残渣(参照特定表)", "脚印", "果核", "毛皮", "涂鸦",
    "坟墓", "蜂巢", "猎人", "受伤的猎物", "兽穴", "兽穴气味", "信件", "交配地", "机械装置(参照特定表)", "标记(在树上等)",
    "粪堆", "杂项物品(参照特定表)", "蜕下的壳", "土堆", "粘液", "泥泞足迹", "麝香气味", "巢穴", "筑巢声", "后代",
    "器官(参照特定表)", "(猛禽的)食余残渣", "信息素", "光滑的表面", "花粉", "仪式残留物", "唾液", "鳞片", "气味(参照特定表)", "烧焦痕迹",
    "阴影", "蜕皮", "贝壳", "信号声", "歌声", "粘液痕迹", "声音(参照特定表)", "潜行声", "剥落的树皮", "符号",
    "牙印", "质感踪迹(参照特定表)", "工具(参照特定表)", "小径", "陷阱", "垃圾", "树干抓痕", "地道", "尿液", "尿骚味",
    "说话声", "(动物的)泥坑", "警告气味", "警告声", "警告标记", "蜡", "武器(参照特定表)", "蛛网", "翅膀", "朝拜者"
];

export const ENVIRONMENT_LOCATIONS = [
    "火山灰地", "恶地", "竹林", "玄武岩柱", "海湾", "海滩", "悬崖，峭壁", "泥沼", "乱石区", "小溪",
    "孤山", "破火山口", "峡谷", "洞穴", "悬崖", "云雾林", "针叶林", "小树林", "峭壁", "火山口",
    "小河", "渡口", "水晶", "落叶林", "三角洲", "沙丘", "沙尘区", "元素场域(参照特定表)", "倒塌的树木", "沼泽地",
    "峡湾", "漫滩", "喷气孔", "间歇泉", "冰川", "峡谷(深)", "岩洞", "树林", "冲沟", "石南荒原",
    "高地", "空洞", "岩柱", "温泉", "冰盖", "丛林", "小丘", "潟湖", "巢穴(与13,58同)", "湖泊",
    "熔岩区", "熔岩管", "湖泊，峡湾", "红树林沼泽", "沼泽", "草地", "平顶山", "泥潭", "荒野", "山脉",
    "泥滩", "绿洲", "油苗", "山口", "牧场", "石化森林", "深坑", "高原", "池塘", "大草原",
    "流沙", "雨林", "急流", "沟壑", "山脊", "河流", "河岸地区", "岩崩处", "盐滩", "盐沼",
    "热带稀树草原", "碎石坡", "灌木丛", "落水洞", "泉水", "干草原", "溪流", "硫磺泉", "沼泽(泛指)", "泰加林",
    "焦油坑", "灌木丛(茂密)", "苔原", "山谷", "火山平原", "火山", "荒地", "瀑布", "湿地", "漩涡"
];

export const ENVIRONMENT_STRUCTURES = [
    "修道院", "祭坛", "圆形剧场", "引水渠", "档案馆", "疯人院", "土匪营地", "谷仓", "战场", "钟楼",
    "篝火", "(天然的)凉亭", "火盆", "建筑物(参照特定表)", "石冢", "车辙小道", "城堡", "地下墓穴", "小教堂", "城市",
    "蓄水池", "女修道院", "十字路口", "水坝", "土路", "石棚墓", "地下城(参照特定表)", "农场", "渡轮", "节日场所",
    "渔夫小屋", "浅滩", "林务员小屋", "堡垒", "绞刑架", "花园", "要塞", "大门", "吊笼", "墓地",
    "村庄", "(巨石)石阵", "隐居处", "藏身处", "公路", "猎人营地", "狩猎小屋", "旅店(参照特定表)", "要塞(与34,37同)", "图书馆",
    "灯塔", "伐木营地", "庄园", "市场", "纪念碑", "磨坊", "矿井", "修道院(与1同)", "独石柱", "纪念性建筑",
    "骡道", "方尖碑", "果园", "前哨站", "铺砌道路", "围栏，畜栏", "朝圣者营地", "柱子", "港口", "监狱",
    "金字塔", "难民营", "道路", "房间(参照特定表)", "废墟", "牧羊人小屋", "神龛", "信号塔", "马厩", "雕像",
    "石桥", "石圈", "勘测员营地", "酒馆", "寺庙", "收费站", "陵墓", "塔楼", "城镇", "商队营地",
    "小径", "陷阱(参照特定表)", "村庄(与41同)", "墙壁", "瞭望塔", "水磨坊", "水井", "风车", "巫师塔", "木桥"
];

export const SYMBOLS = [
    "动物(参照特定表)", "鹿角", "箭矢", "斧头", "熊", "铃铛", "鸟", "血滴", "书籍(参照特定表)", "靴子",
    "弓", "碗", "树枝", "火盆", "大锅", "链条", "战车", "圆圈", "衣物(参照特定表)", "云",
    "钱币", "星座", "螃蟹", "十字架", "王冠", "水晶", "匕首", "鹿", "骰子", "眼睛",
    "尖牙", "羽毛", "鱼", "拳头", "花朵", "喷泉", "食物(参照特定表)", "形态(参照特定表)", "狐狸", "青蛙",
    "大门", "山羊", "锤子", "手", "心脏", "头盔", "钩子", "角", "马", "沙漏",
    "钥匙", "绳结", "灯", "叶子", "闪电束", "锁", "面具", "杂项物品(参照特定表)", "月亮", "坚果",
    "章鱼", "器官(参照特定表)", "牛", "笔", "钳子", "松果", "行星", "兔子", "老鼠", "戒指",
    "蝎子", "天平", "卷轴", "蛇", "盾牌", "镰刀", "头骨", "蜗牛", "雪花", "矛",
    "螺旋", "正方形", "法杖", "星星", "太阳", "剑", "触手", "王座", "牙齿", "火把",
    "树", "三角形", "乌龟", "波浪", "武器(参照特定表)", "网", "鲸", "鞭子", "翅膀", "狼"
];

export const TEXTURES = [
    "充气的", "带电的", "混合的", "沸腾的", "微咸的", "冒泡的", "黄油味的", "焦糖化的", "粉状的", "冰镇的",
    "块状的", "翻腾的", "凝结的", "凝固的", "浓缩的", "凝胶的", "凉爽的", "奶油状的", "结晶的", "凝乳状的",
    "沉渣的", "泡腾的", "薄膜状的", "嘶嘶作响的", "薄片状的", "泡沫状的", "雾状的", "冰冷的", "结霜的", "泡沫丰富的",
    "胶状的", "微光的", "粘稠的(液)", "发光的", "胶粘的", "颗粒状的", "油腻的(与58同)", "粗砂的", "渣滓的", "胶质的",
    "粘腻的", "汩汩作响的", "嘶嘶作响的(与24同)", "嗡嗡作响的", "脓水似的", "冰凉的", "果冻状的", "活生生的", "温吞的", "块状的(与11同)",
    "捣碎的", "金属质感的", "微粒状的", "移动的", "泥泞的", "混浊的", "糊状的", "油腻的", "渗出的", "膏状的",
    "粉末状的", "布丁状的", "果肉状的", "脉动的", "菜泥状的", "水银似的", "反光的", "波纹状的", "翻滚的", "沙状的",
    "树液似的", "滚烫的", "浮渣的", "沉淀物的", "闪耀的", "粉砂质的", "煨炖的", "滋滋作响的", "粘滑的", "雪泥状的",
    "冒烟的", "烟熏味的", "肥皂似的", "闪闪发光的", "冒热气的", "粘性的", "旋转的", "糖浆似的", "焦油似的", "稀薄的",
    "搏动的", "颤抖的", "汹涌的", "振动的", "粘稠的", "粘滞的", "温热的", "水汪汪的", "呼呼旋转的", "呼啸的"
];

export const TASTES = [
    "苦艾酒味", "多香果味", "杏仁味", "氨水味", "动物味", "芦笋味", "罗勒味", "啤酒味", "浆果味", "黑醋栗味",
    "黑莓味", "血腥味", "黄油味", "樟脑味", "糖果味", "焦糖味", "小豆蔻味", "樱桃味", "辣椒味", "细香葱味",
    "巧克力味", "肉桂味", "丁香味", "椰子味", "咖啡味", "铜臭味", "蔓越莓味", "原油味", "黄瓜味", "孜然味",
    "咖喱味", "枣子味", "接骨木果味", "无花果味", "花香味", "鱼腥味", "食物味", "甲醛味", "大蒜味", "汽油味",
    "姜味", "火药味", "仓鼠笼味", "干草味", "草药味", "蜂蜜味", "啤酒花味", "熏香味", "皮革味", "柠檬味",
    "甘草味", "青柠味", "壤土味", "枫糖浆味", "蜂蜜酒味", "牛奶味", "矿物味", "薄荷味", "泥土味", "芥末味",
    "肉豆蔻味", "橡木味", "橄榄油味", "洋葱味", "橙子味", "牛至味", "桃子味", "梨味", "胡椒味", "痰味",
    "泡菜汁味", "松木味", "开心果味", "李子味", "南瓜味", "木梨味", "大黄味", "烤鸭味", "玫瑰味", "迷迭香味",
    "酸牛奶味", "辛辣味", "云杉味", "停滞味", "变质啤酒味", "臭奶酪味", "硫磺味", "汗臭味", "味觉(参照特定表)", "茶味",
    "百里香味", "烟草味", "松节油味", "香草味", "醋味", "紫罗兰味", "呕吐物味", "湿纸板味", "湿狗味", "木柴烟味"
];

export const COLORS = [
    "酸性绿", "雪花石膏白", "琥珀色", "紫水晶色", "杏黄色", "海蓝宝石色", "芦笋绿", "赤褐色", "藤黄色", "鳄梨色",
    "天蓝色", "淡蓝色", "米色", "骨白色", "墨绿色", "青铜色", "泡泡糖粉色", "洋红色(胭脂红)", "胡萝卜色", "青瓷色",
    "樱桃红", "天青石色", "香槟色", "炭黑色", "黄绿色", "栗色", "肉桂色", "无色", "铜色", "珊瑚粉色",
    "乳白色(与58同)", "深红色", "青色", "鸽灰色", "暗褐色", "蛋壳色", "电光蓝色", "翠绿色", "肉色", "紫红色",
    "煤烟黑", "金色", "葡萄汁色", "天芥菜紫", "冰蓝色", "靛蓝色", "墨黑色", "无形的", "象牙色", "鲜绿色",
    "淡紫色", "紫丁香色", "青柠色", "洋红色", "红木色", "栗色，褐红色", "淡紫色(与52同)", "乳白色", "苔藓绿", "芥末色",
    "赭色", "橄榄色", "乳白色(蛋白石色)", "暗红色", "豌豆绿", "桃色", "孔雀蓝色", "珍珠色", "长春花色", "松绿色",
    "李子色", "报春花黄", "南瓜色", "彩虹色", "玫瑰色", "红宝石色", "赤褐色(铁锈色)", "铁锈色", "藏红花色", "鲑鱼色",
    "蓝宝石色", "猩红色", "乌贼墨色", "鲜粉红色", "银色", "石板蓝色", "烟灰色", "橘红色", "青绿色", "赤陶色",
    "提香红", "番茄红", "绿松石色", "泰雅紫", "群青色", "棕土色", "铜绿色", "朱红色", "紫罗兰色", "鲜绿色(草绿)"
];

export const INGREDIENTS = [
    "动物(参照特定表)", "锑", "砷", "颠茄茄", "沥青", "黑珍珠", "盲人之眼", "书籍(参照特定表)", "硫磺", "樟脑",
    "白屈菜", "粉笔", "衣物(参照特定表)", "钴", "苍耳", "棺材钉", "耧斗菜", "铜", "尸体的头发", "十字路口的尘土",
    "蒲公英", "毒鹅膏", "曼陀罗花", "元素(参照特定表)", "布料(参照特定表)", "食物(参照特定表)", "毛地黄", "葬礼用酒", "黄金", "坟墓的尘土",
    "嚏根草", "毒芹", "天仙子", "冬青", "蜂蜜", "牛膝草", "铁", "凶手的手", "国王的牙齿", "飞燕草",
    "最后的呼吸", "铅", "说谎者的舌头", "闪电束", "石灰", "磁石", "莲花", "碱液", "曼德拉草", "材料(参照特定表)",
    "绣线菊", "杂项物品", "槲寄生", "僧侣的誓言", "怪物(参照特定表)", "月光花", "艾草", "泡碱", "花蜜", "荨麻",
    "新生儿的哭声", "镍", "颠茄(与4同)", "器官(参照特定表)", "铂金", "罂粟", "药水(参照特定表)", "柴堆的余烬", "蜂后", "女王的血液",
    "水银", "豚草", "树脂", "迷迭香", "鼠尾草", "海水", "船体附着的藤壶", "银", "蛇草", "煤烟",
    "星之金属", "鬼笔菌", "糖", "盗贼的手指", "蓟", "锡", "墓地之花", "工具(参照特定表)", "宝藏(参照特定表)", "缬草",
    "铜绿", "醋", "蜡", "武器(参照特定表)", "结婚戒指", "寡妇的眼泪", "金缕梅", "巫师的头骨", "乌头", "苦艾草"
];

export const CITY_THEMES = [
    "炼金术", "动物(参照特定表)", "贵族统治", "艺术", "疯人院", "活动(参照特定表)", "银行业", "浴场", "乞讨", "钟楼，钟声",
    "酿酒", "桥梁", "建筑物(参照特定表)", "官僚主义", "商业", "运河", "地下墓穴", "猫", "城市事件(参照特定表)", "法庭",
    "犯罪家族", "邪教", "舞蹈", "幻觉(参照特定表)", "餐饮", "灾难(参照特定表)", "领域(参照特定表)", "饮酒", "决斗", "地下城(参照特定表)",
    "元素(参照特定表)", "阵营(参照特定表)", "阵营特性(参照特定表)", "时尚", "节日", "世仇", "渔业", "花卉", "食物(参照特定表)", "防御工事",
    "喷泉", "赌博", "帮派", "花园", "政府", "公会", "危险(参照特定表)", "马匹", "饥饿", "工业",
    "发明创造", "休闲娱乐", "图书馆", "牲畜", "魔法学派(参照特定表)", "市场", "陵墓", "医学", "雇佣兵", "军事",
    "修道院", "纪念碑", "博物馆", "音乐", "突变(参照特定表)", "奢华", "香水", "印刷", "监狱", "职业(参照特定表)",
    "惩罚", "老鼠", "渡鸦", "垃圾", "仪式", "房间主题(参照特定表)", "废墟", "献祭", "科学", "造船厂",
    "献祭", "分裂", "连环杀手", "围攻", "地陷", "烟雾", "社会丑闻", "恶臭", "街头赛车", "召唤仪式",
    "纺织品", "剧院", "盗窃", "塔楼", "训练", "旅行变动(参照特定表)", "宝藏(参照特定表)", "树木", "大学", "巫术"
];

export const CITY_EVENTS = [
    "活动(参照特定表)", "禁酒令", "艺术潮流", "暗杀", "乞丐成群", "祝福", "建筑倒塌", "狂欢节", "征兵", "祝圣仪式",
    "建设施工", "加冕典礼", "政变", "犯罪浪潮", "宵禁", "代表团", "幻觉(参照特定表)", "拆除", "灾难(参照特定表)", "发现",
    "决斗风尚", "地震", "选举", "挖掘", "处决", "大批出走", "阵营战争(参照特定表)", "时尚禁令", "时尚潮流", "斋戒",
    "宴会", "火灾", "洪水", "葬礼", "赌博禁令", "帮派火并", "粮食短缺", "异端邪说", "圣日", "家族战争",
    "歇斯底里", "偶像破坏运动", "移民潮", "宗教裁判", "叛乱", "入侵", "越狱", "绑架", "山体滑坡", "魔法禁令",
    "搜捕", "大规模逮捕", "大规模皈依", "大规模处决", "大规模驱逐", "大规模赦免", "肉类短缺", "阅兵", "传教士", "哀悼",
    "泥泞", "突变(参照特定表)", "新发明", "巡逻", "和谈", "朝圣者", "瘟疫", "政治丑闻", "布道", "游行队伍",
    "公告", "抗议", "公开辩论", "公开竞技", "公开祈祷", "难民", "宗教会议", "宗教丑闻", "宗教战争", "暴动",
    "献祭", "分裂", "连环杀手", "围攻", "地陷", "烟雾", "社会丑闻", "恶臭", "街头赛车", "召唤仪式",
    "投降", "税收", "纺织品短缺", "锦标赛", "旅行变动(参照特定表)", "审判", "故意破坏", "害虫滋生", "武器禁令", "婚礼"
];

export const STREET_DETAILS = [
    "活动(参照特定表)", "动物(参照特定表)", "引水渠", "拱廊，游廊", "拱门", "遮阳篷", "阳台", "路障", "长凳", "篝火",
    "砌砖工", "桥梁", "碎玻璃", "建筑物(参照特定表)", "运河", "地毯(铺在街上)", "马车", "手推车", "(建筑间的)过道，猫道", "检查站",
    "儿童", "烟囱", "神职人员", "可攀爬的墙壁", "晾衣绳", "堆肥堆", "板条箱", "人群", "摇摇欲坠的墙壁", "死胡同",
    "满是灰尘的", "街头艺人", "栅栏", "洪水泛滥", "食品摊位", "喷泉", "未干的油漆", "真菌(生长在墙角等)", "花园(沿街)", "煤气泄漏",
    "大门", "涂鸦", "碎石路面", "守卫", "干草堆", "危险(参照特定表)", "热煤", "梯子", "灯柱", "提灯",
    "牲畜", "长长的台阶", "粪堆", "杂项物品(参照特定表)", "泥泞", "狭窄", "贵族", "漏油", "(植被)蔓生", "轿子",
    "扒手", "一堆破布", "地点特性(参照特定表)", "花粉云", "水池", "海报", "职业(参照特定表)", "屋顶通道", "房间细节(参照特定表)", "树根(暴露的)",
    "绳索(横跨街道)", "环形交叉路口", "沙堆", "脚手架", "污水", "下水道入口", "神龛", "落水洞，地陷", "空中走廊", "烟雾",
    "洒落的水果", "雕像", "蒸汽", "陡峭的屋顶", "陡峭的街道", "踏脚石", "街道清洁工", "街头叫卖者", "青少年", "帐篷",
    "暴徒", "火把", "破损的街道", "树木", "地道入口", "害虫群", "武器摊位", "水井", "未干的水泥", "泼洒的葡萄酒"
];

export const BUILDINGS = [
    "学院", "炼金术士作坊", "药剂师店铺", "档案馆", "盔甲匠铺", "艺术品经销商", "疯人院", "面包店", "银行", "理发店",
    "浴室", "铁匠铺", "装订匠作坊", "书店", "弓箭匠铺", "酿酒厂", "肉铺", "蜡烛制造商", "木匠铺", "城堡",
    "地下墓穴", "杂货商(蜡烛/船用)", "奶酪制造商", "钟表匠铺", "服装店", "鞋匠铺", "法院", "犯罪巢穴", "珍奇品商店", "码头",
    "地下城(参照特定表)", "染坊", "角斗场", "制箭师", "算命师", "毛皮商", "画廊", "赌场", "花园", "门房",
    "玻璃制品厂", "金匠铺", "公会大厅", "帽商", "医院", "旅店(参照特定表)", "珠宝商", "律师事务所", "皮革作坊", "图书馆",
    "锁匠铺", "休息室，酒吧", "庄园，宅邸", "市场", "石匠铺", "动物园", "修道院", "放债人", "博物馆", "天文台",
    "歌剧院", "孤儿院", "装备用品店", "宫殿", "公园", "诊所", "陶器作坊", "印刷厂", "监狱", "餐厅",
    "制绳厂", "房间(参照特定表)", "马具匠铺", "下水道(入口/管理处)", "造船厂", "神龛", "屠宰场", "马厩", "牲畜市场", "石匠作坊(与55同)",
    "构筑物(参照特定表)", "裁缝店", "皮革厂", "纹身店", "动物标本剥制师", "寺庙", "剧院", "烟草店", "联排别墅", "大学",
    "兽医", "仓库", "瞭望塔", "水磨坊", "武器匠铺", "织布厂", "风车", "酿酒厂(葡萄酒)", "巫师塔", "作坊，工坊"
];
