export const STARTING_ARMOR = [
    { roll: [1, 2, 3], name: "无甲", defense: 11, bonus: 1, slots: 0, quality: 0 },
    { roll: [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], name: "软甲 (Gambeson)", defense: 12, bonus: 2, slots: 1, quality: 3 },
    { roll: [15, 16, 17, 18, 19], name: "镶嵌甲 (Brigandine)", defense: 13, bonus: 3, slots: 2, quality: 4 },
    { roll: [20], name: "链甲 (Chain)", defense: 14, bonus: 4, slots: 3, quality: 5 },
];

export const STARTING_HELM_SHIELD = [
    { roll: 13, text: "无" }, // 1-13
    { roll: 16, text: "头盔" }, // 14-16
    { roll: 19, text: "盾牌" }, // 17-19
    { roll: 20, text: "头盔 + 盾牌" }, // 20
];

export const DUNGEONEERING_GEAR = [
    "绳索 (50')", "滑轮", "蜡烛 (5)", "链条 (10')", "粉笔 (10)",
    "撬棍", "火绒盒", "抓钩", "锤子", "水袋",
    "提灯", "灯油", "挂锁", "手铐", "镜子",
    "长杆 (10')", "麻袋", "帐篷", "长钉 (5)", "火炬 (5)"
];

export const GENERAL_GEAR_1 = [
    "气囊", "捕兽夹", "铲子", "风箱", "油脂",
    "锯子", "水桶", "蒺藜", "凿子", "钻头",
    "鱼竿", "弹珠", "胶水", "镐子", "沙漏",
    "网", "钳子", "开锁器", "金属锉刀", "钉子"
];

export const GENERAL_GEAR_2 = [
    "焚香", "海绵", "透镜", "香水", "号角",
    "瓶子", "肥皂", "望远镜", "焦油罐", "细绳",
    "假珠宝", "空书", "牌组", "骰组", "煮锅",
    "脸彩", "哨子", "乐器", "羽毛笔&墨水", "小铃铛"
];

export const POTIONS = [
    "年龄变化", "通晓所有语言", "改变身体", "改变面容", "改变声音", "动物形态", "护甲(魔法)", "野兽交谈", "鸟类交谈", "无需呼吸",
    "长爪", "抗寒", "勇气", "治疗疾病", "治疗中毒", "治疗创伤", "黑暗视觉", "与死者交谈", "幻觉(参照特定表)", "效果(参照特定表)",
    "弹性", "元素形态", "额外手臂", "假死", "恐惧", "火焰形态", "鱼类交谈", "飞行", "遗忘", "友谊",
    "生长", "蛆虫交谈", "憎恨", "治疗(与16同)", "听力增强", "抗热", "无需进食", "冰霜形态", "照明", "虚体化",
    "隐形", "刀枪不入", "钢铁胃", "跳跃增强", "闪电形态", "抗闪电", "爱恋", "兽化症", "抗魔法", "习性(参照特定表)",
    "抗金属", "力量增强", "读心术", "怪物特性", "突变", "非玩家角色细节", "器官(参照特定表)", "软泥形态", "偏执", "个性(参照特定表)",
    "植物交谈", "抗毒", "能力(参照特定表)", "职业(参照特定表)", "狂暴", "感知危险", "感知方向", "感知邪恶", "感知黄金", "感知热量",
    "感知幻术", "感知谎言", "感知魔法", "感知不死生物", "缩小", "睡眠", "无眠", "烟雾形态", "嗅探增强", "万能酸液",
    "万能胶水", "万能油脂", "万能毒药", "速度", "棘刺", "毒刺", "岩石交谈", "游泳", "心灵遥控", "思想传递",
    "不死状态", "吸血鬼化", "腹语术", "视力增强", "爬墙", "水下呼吸", "水面行走", "蛛丝投射", "X光视力", "年轻化"
];

export const TOOLS = [
    "酸液瓶", "动物气味剂", "解毒剂", "星盘", "子弹带", "捕熊夹", "睡袋", "蜂蜡", "铃铛", "风箱",
    "鸟笼", "空白书册", "毯子", "滑轮组", "断线钳", "瓶子", "桶", "牛眼提灯", "铁蒺藜", "蜡烛",
    "香炉", "链条", "粉笔", "凿子", "攀爬钩", "指南针", "铜线", "撬棍", "骰子", "撞门锤",
    "助听喇叭", "乙醚", "火油", "鱼钩", "闪光弹", "闪光粉", "大蒜", "胶水", "抓钩", "油脂",
    "钢锯", "锤子", "手钻", "麻绳", "猪夹(捕猪用具)", "带罩提灯", "猎犬", "沙漏", "熏香", "铁锅",
    "铁钳", "提灯", "大麻袋", "开锁工具", "磁石", "放大镜", "手铐", "弹珠", "金属锉刀", "研钵和研杵",
    "骡子", "网", "挂锁和钥匙", "钢笔和墨水", "鹤嘴锄", "干草叉", "岩钉", "钳子(与51相似)", "毒药", "长杆(10英尺)",
    "纯酒精", "老鼠", "朗姆酒", "药膏", "剪刀", "封蜡", "缝衣针", "六分仪", "铲子", "丝绳",
    "大锤", "烟雾弹", "烟熏护目镜", "肥皂", "长钉", "望远镜", "木桩", "钢镜", "日晷", "帐篷",
    "厚手套", "火绒盒", "火把", "号角", "细绳", "小瓶", "水袋", "磨刀石", "哨子", "乌头草"
];

export const MISCELLANEOUS = [
    "护身符", "箭头", "鸟笼", "书籍(参照特定表)", "碗", "盒子", "胸针", "纽扣", "卡片", "密码",
    "钟", "衣物(参照特定表)", "钱币", "梳子", "水晶", "杯子", "学位证书", "玩偶", "鼓", "蛋",
    "刺绣品", "布料(参照特定表)", "羽毛", "小雕像", "指骨", "旗帜", "长笛", "食物(参照特定表)", "食谱", "叉子",
    "游戏棋子", "宝石", "发油", "发梳", "手帕", "号角(乐器)", "圣像", "原料(参照特定表)", "罐子", "钥匙",
    "小刀", "长柄勺", "腿骨", "透镜", "信件", "要求清单", "一绺头发", "小盒坠子", "乳液", "鲁特琴",
    "七弦琴", "宣言书", "地图", "睫毛膏", "材料(参照特定表)", "军事命令", "镜子", "球体，宝珠", "器官(参照特定表)", "画笔",
    "绘画", "护照", "珍珠", "香水", "烟斗", "风笛", "诗", "肖像画", "药水(参照特定表)", "药水配方",
    "祈祷文", "压花", "钱包", "谜题盒", "金字塔(小)", "剃刀", "缎带", "戒指", "胭脂", "购物清单",
    "印章戒指", "素描本", "头骨", "鼻烟壶", "抹刀", "法术卷轴", "法术书", "勺子", "星图", "票",
    "工具(参照特定表)", "牙齿", "宝藏(参照特定表)", "条约", "音叉", "魔杖", "逮捕令", "武器(参照特定表)", "葡萄酒", "纱线"
];

export const BOOKS = [
    "冒险小说", "农业学", "年历", "解剖学", "古代史", "考古学", "建筑学", "占星术", "怪物图鉴", "传记",
    "勒索信件", "植物学", "日历", "城市主题", "喜剧小说", "商业学", "谴责书", "忏悔录", "阴谋论", "食谱书",
    "犯罪秘闻", "密码学", "文化研究", "风俗习惯", "外交学", "灾难(参照特定表)", "占卜术", "领域(参照特定表)", "地下城主题", "史诗",
    "间谍活动", "伦理学", "礼仪规范", "阵营(参照特定表)", "时尚杂志", "金融学", "渔业", "民间传说", "家谱学", "地理学",
    "地质学", "鬼故事集", "神学(关于诸神)", "圣徒传记", "纹章学", "恐怖故事集", "狩猎技巧", "畜牧学", "日记，日志", "语言学",
    "法律书", "信件集", "图书馆学", "逻辑学", "失落的帝国", "失落之地", "爱情诗集", "魔法学派", "数学", "医学",
    "近代史", "怪物(参照特定表)", "音乐理论", "推理小说", "神话学", "国家概况", "航海术", "海洋学", "绘画理论", "位面研究",
    "政治学", "药水配方", "祈祷书", "职业(参照特定表)", "宣传册", "预言书", "心理学", "地区研究", "宗教研究", "修辞学",
    "言情小说", "房间主题", "贤者语录", "格言集", "雕塑艺术", "秘密社团", "造船术", "神龛研究", "攻城术", "歌集",
    "法术(参照特定表)", "国家机密", "剑术教程", "神学(理论)", "陷阱(参照特定表)", "宝藏传说", "乌托邦小说", "战争编年史", "名人录", "猎巫手册"
];

export const CLOTHING = [
    "白麻布祭袍", "臂带", "武装紧身衣", "轻便盔", "腰带", "贝雷帽", "双角帽", "衬衫(女式)", "紧身胸衣", "无边女帽",
    "靴子", "手镯", "灯笼裤", "胸甲", "马裤", "小圆盾", "便帽", "披风", "(教士穿的)法衣", "披肩帽",
    "(教士的)祭披", "(教士的)束腰带", "斗篷", "木屐", "外套", "胯袋", "束腹", "衬裙(女式)", "风帽", "领巾",
    "胸甲(金属)", "(教士的)长袍", "短上衣", "连衣裙", "耳环", "眼罩", "土耳其毡帽", "蛙嘴盔", "布面甲", "铁手套",
    "(束腰的)腰带", "手套", "护喉甲", "长袍(女式)", "重盔", "护胫甲", "帽子", "锁子甲", "头饰", "头盔",
    "兜帽", "长筒袜", "犬首盔", "霍普兰长袍", "夹克", "无袖短上衣", "头巾", "苏格兰短裙", "寇特(紧身外衣)", "腿部裹布",
    "манипул(祭披垂带)", "面具", "主教冠", "鼻甲盔", "项链", "睡帽", "肩甲", "衬裙", "口袋", "尖顶帽",
    "钱包", "臂铠(上臂)", "长袍", "铁靴", "萨雷特盔", "凉鞋", "腰带(装饰性)", "围巾", "盾牌(衣物徽章)", "衬衫",
    "鞋子", "裙子", "袖子", "拖鞋", "罩衫", "袜子", "长筒袜(与52同)", "(教士的)披肩", "无袖外袍", "(教士的)白麻短罩衣",
    "(纹章)短外套", "塔盾", "三角帽", "裤子", "束腰外衣", "头巾(缠头)", "臂铠(前臂)", "面纱", "背心", "(女式)头巾，面罩"
];

export const FABRICS = [
    "鳄鱼皮", "羊驼毛", "动物皮", "獾皮", "竹编", "树皮布", "熊皮", "海狸皮", "毛毯料", "黄铜(片/丝)",
    "织锦", "青铜(片/丝)", "粗麻布", "小牛皮", "印花布", "骆驼毛", "骆驼皮", "帆布", "开司米(山羊绒)", "猫毛",
    "青年布", "雪纺绸", "卡其布", "椰子纤维", "铜(片/丝)", "灯芯绒", "棉布", "牛皮", "绉纱", "锦缎",
    "鹿皮", "牛仔布", "狗毛", "鳗鱼皮", "毛毡", "鱼皮", "渔网", "法兰绒", "亚麻(原料)", "抓绒",
    "狐皮", "纱布", "格子花布", "山羊皮", "草编", "大麻纤维", "人字呢", "马毛", "马皮", "铁(片/丝)",
    "黄麻", "蕾丝", "羊羔毛", "羊羔皮", "皮革", "豹皮", "亚麻布", "狮子皮", "美洲驼毛", "锁子甲(布料感)",
    "网眼布", "貂皮", "貂皮(处理后)", "马海毛", "怪物皮", "平纹细布", "油布", "鸵鸟皮", "水獭皮", "拼布",
    "猪皮", "被子料", "兔皮", "破布", "鼠皮", "驯鹿皮", "帆布(与18同)", "缎子", "海豹皮", "泡泡纱",
    "绵羊皮", "绵羊毛", "丝绸", "蛇皮", "松鼠皮", "钢(片/丝)", "珍珠鱼皮", "麂皮", "塔夫绸", "苏格兰格子呢",
    "毛巾布", "虎皮", "金属箔丝", "薄纱", "花呢", "斜纹布", "天鹅绒(仿)", "天鹅绒", "狼皮", "牦牛毛"
];

export const DECORATIONS = [
    "古董风格", "钉珠的", "野兽图案", "铃铛装饰", "鸟类图案", "血迹斑斑的", "骨制装饰", "带扣", "纽扣(装饰性)", "链条装饰",
    "风铃片装饰", "云纹图案", "盾形纹章", "颜色(参照特定表)", "绳索装饰", "装饰性钱币", "做旧效果", "羽绒填充的", "徽章", "刺绣的",
    "珐琅别针", "羽毛装饰", "华丽的", "火焰图案", "花卉图案", "鲜花装饰", "食物污渍", "正式的", "流苏", "毛皮衬里",
    "毛皮镶边", "金钉", "金线", "小丑服图案", "厚重的", "纹章(与13同)", "角制装饰", "墨迹斑斑的", "物品特性", "珠宝装饰",
    "蕾丝镶边", "系带的", "奖章(装饰性)", "发霉的", "怪物图案", "月亮图案", "虫蛀的", "泥泞的", "海洋图案", "华丽的边饰",
    "超大号", "带衬垫的", "佩斯利涡旋纹", "补丁", "珍珠装饰", "带香味的", "电镀的", "口袋(装饰性)", "穿孔的", "散发恶臭的",
    "水钻装饰", "罗纹的", "丝带装饰", "荷叶边", "缎带蝴蝶结", "暴露的，不雅的", "气味(参照特定表)", "暗袋", "亮片", "闪光的",
    "印记，符号", "银钉", "银线", "紧身的", "头骨图案", "开叉的，镂空的", "闪闪发光的", "带尖刺的", "斑点图案", "星星图案",
    "上浆的，挺括的", "石洗效果", "条纹图案", "镶钉的", "太阳图案", "日晒褪色的", "符号(参照特定表)", "流苏(与29同)", "动物标本(装饰)", "磨损的",
    "扎染的", "撕裂的", "树木图案", "过小的", "过时的", "天鹅绒贴花", "波浪图案", "红酒渍", "褶皱的", "Z字形图案"
];
