// 怪物与生物相关随机表

export const MONSTERS = [
    "底栖魔鱼", "恐狼", "巨型蜘蛛", "北海巨妖", "大鹏", "气元素", "巨灵", "巨型鼬", "巫妖", "绳怪",
    "天使", "变形怪", "豺狼人", "蜥蜴人", "锈蚀怪", "动物(参照特定表)", "龙", "地精", "蝎尾狮", "萨提尔",
    "活化盔甲", "树精", "魔像", "人鱼", "幽影", "报丧女妖", "土元素", "牛头蛇尾怪", "拟形怪", "骷髅",
    "蛇怪", "火巨灵", "灰泥怪", "牛头人", "狮身人面像", "黑布丁怪", "眼魔", "狮鹫", "木乃伊", "刺吸怪",
    "闪现犬", "火元素", "鬼婆", "蕈人", "魅魔", "夺心魔", "石像鬼", "鸟妖", "娜迦", "泰拉斯奎巨兽",
    "熊地精", "胶质方块", "地狱犬", "赭冻怪", "树人", "地穴甲虫", "鬼魂", "骏鹰", "食人魔", "巨魔",
    "半人马", "食尸鬼", "大地精", "兽人", "霸王龙", "奇美拉", "巨人", "魔宠", "枭熊", "独角兽",
    "鸡蛇", "巨型动物(参照特定表)", "钩刺恐魔", "天马", "吸血鬼", "爬行断手", "巨型蜈蚣", "九头蛇", "鹿角翼兽", "水元素",
    "独眼巨人", "巨型螃蟹", "小恶魔", "相位蜘蛛", "狼人", "暗幕蝠", "巨型青蛙", "食脑怪", "穿刺虫", "双足飞龙",
    "死亡骑士", "巨型蝎子", "隐形潜伏者", "紫虫", "雪人", "恶魔", "巨型蛇", "狗头人", "罗刹", "僵尸"
];

export const ANIMALS = [
    "蚂蚁", "母牛", "鹅", "驼鹿", "海豹", "食蚁兽", "郊狼", "野兔", "蛾", "鲨鱼",
    "猿猴", "螃蟹", "雄鹿", "老鼠", "绵羊", "獾", "鹤", "隼", "骡子", "蛞蝓",
    "蝙蝠", "蟋蟀", "刺猬", "章鱼", "蜗牛", "熊", "鳄鱼", "大黄蜂", "水獭", "麻雀",
    "海狸", "乌鸦", "马", "猫头鹰", "蜘蛛", "蜜蜂", "杜鹃", "猎犬", "牛", "鱿鱼",
    "甲虫", "驴", "蜂鸟", "豹", "松鼠", "野猪", "蜻蜓", "豺狼", "猪", "老虎",
    "斗牛犬", "鸭", "水母", "小马", "蟾蜍", "蝴蝶", "鹰", "水蛭", "豪猪", "乌龟",
    "骆驼", "鳗鱼", "狮子", "负鼠", "蝰蛇", "猫", "大象", "蝗虫", "兔子", "秃鹫",
    "蜈蚣", "麋鹿", "猞猁", "浣熊", "海象", "变色龙", "猎鹰", "螳螂", "大鼠", "黄鼠狼",
    "眼镜蛇", "萤火虫", "乳齿象", "驯鹿", "鲸", "蟑螂", "狐狸", "反舌鸟", "公鸡", "狼",
    "巨蟒", "青蛙", "鼹鼠", "蝾螈", "狼獾", "美洲狮", "山羊", "猴子", "蝎子", "蠕虫"
];

export const MONSTER_TRAITS = [
    "触角", "蟋蟀腿", "蜂鸟翅膀", "鹈鹕喙", "斑点皮毛", "鹿角", "可断离的尾巴", "驼峰", "猪鼻子", "鱿鱼喙",
    "鲸须", "挖掘爪", "大耳朵", "猪尾", "毒刺", "蝙蝠翅膀", "蜻蜓翅膀", "大眼睛", "钳子", "条纹皮毛",
    "海狸尾巴", "鸭嘴", "大门牙", "骨板", "短粗的尾巴", "喷水孔", "鹰翼", "长身体", "羽毛", "吸盘",
    "脂肪层", "象牙", "长耳朵", "长鼻", "爪(鸟类的)", "野猪獠牙", "外骨骼", "长腿", "伪足", "卷须",
    "浓密的尾巴", "眼柄", "长脖子", "羽管", "触手", "蝴蝶翅膀", "猎鹰喙", "长鼻子", "鼠尾(与57相似)", "巨嘴鸟喙",
    "甲壳", "尖牙", "长舌", "鳞片", "象鼻", "猫尾", "羽毛(与66同)", "松弛的皮肤", "蝎尾", "龟壳",
    "变色龙眼睛", "鱼鳍", "大颚", "体节", "乳房", "爪子", "苍蝇翅膀", "鬃毛", "浓密的毛发", "海象獠牙",
    "眼镜蛇的头罩", "蛙腿", "螳螂臂", "短毛", "疣", "鸡冠", "鳃", "猴尾", "虹吸管", "肉垂",
    "复眼", "滑翔翼膜", "鼠耳", "蜗牛壳", "蹼足", "蟹壳", "蹄子", "粘液", "尖刺", "蹼手",
    "鹤喙", "角", "水獭尾巴", "棘刺(与78同)", "胡须", "羽冠", "马尾", "牡蛎壳", "喷丝头", "羊毛"
];

export const MONSTER_FEATURES = [
    "酸性血液", "永葆青春的", "虹彩的", "独眼的", "冒烟的", "水陆两栖的", "无眼的", "大头的", "软泥形态的", "柔软的",
    "古老的", "无面的", "无腿的", "器官(参照特定表)", "煤烟似的", "动物形态(参照特定表)", "剥落的", "液态的", "个性(参照特定表)", "声音(参照特定表)",
    "活化的", "易燃的", "发光的", "有毒的", "冒火花的", "不对称的", "灵活的", "块状的", "药水(参照特定表)", "冒蒸汽的",
    "臃肿的", "毛茸茸的", "习性(参照特定表)", "粉末状的", "黏性的", "无血的", "泡沫状的", "多臂的", "能力(参照特定表)", "发臭的",
    "易碎的", "真菌状的", "多眼的", "脉动的", "石头似的", "燃烧的", "毛躁的", "多面的", "放射性的", "可伸缩的",
    "带电的", "气态的", "多头", "反光的", "战术(参照特定表)", "粘土般的", "胶状的", "多腿", "橡胶似的", "质感(参照特定表)",
    "颜色(参照特定表)", "几何形状的", "多嘴", "气味(参照特定表)", "微小的", "巨大的", "掉毛的", "机械的", "阴影般的", "半透明的",
    "水晶般的", "无毛的", "金属的", "锋利的", "树木似的", "腐烂的", "多毛的", "肢体不协调的", "短肢的", "二维的",
    "幻觉(参照特定表)", "硬化的", "换毛的", "枯萎的", "有毒液的", "元素皮肤(参照特定表)", "无头的", "肌肉发达的", "骷髅似的", "振动的",
    "细长的", "冰冷的", "突变(参照特定表)", "蜕皮的", "蜡质的", "虚体的", "幻影的", "无颈的", "粘滑的", "弱点(参照特定表)"
];

export const MONSTER_ABILITIES = [
    "吸收能力", "回声定位", "火焰吐息", "悬浮", "复活死者", "酸性光环", "效果(参照特定表)", "控制火焰", "闪电箭矢", "移除诅咒",
    "酸性箭矢", "效果光环(参照特定表)", "点火", "闪电吐息", "排斥", "酸性吐息", "效果爆发(参照特定表)", "火墙", "爱之光环", "腐化",
    "星界投射", "效果箭矢(参照特定表)", "迷雾吐息", "磁力控制", "冲击波", "吸引", "效果射线(参照特定表)", "力场墙", "记忆控制", "沉默",
    "控制野兽", "电击光环", "友谊光环", "模仿声音", "睡眠光环", "控制鸟类", "元素光环(参照特定表)", "重力控制", "心灵控制", "减速敌人",
    "致盲", "元素爆发(参照特定表)", "催生植物", "塑造血肉", "法术(参照特定表)", "模糊", "元素箭矢(参照特定表)", "憎恨光环", "塑造金属", "控制灵魂",
    "掘穴", "元素吐息(参照特定表)", "治疗光环", "塑造岩石", "石墙", "变色龙皮肤", "元素控制(参照特定表)", "催眠术", "麻痹", "召唤",
    "千里耳", "元素射线(参照特定表)", "冰霜光环", "偏执光环", "整个吞下", "千里眼", "元素墙(参照特定表)", "冰霜箭矢", "石化", "交换思想",
    "自我复制", "纠缠", "冰霜吐息", "位面传送", "传送", "创造幻象", "活埋", "冰墙", "控制植物", "时间控制",
    "致聋", "爆炸", "不动如山", "剧毒光环", "旅行变动(参照特定表)", "吸取生命", "恐惧光环", "控制昆虫", "剧毒吐息", "控制不死生物",
    "梦境漫游", "火焰光环", "铁墙", "药水(参照特定表)", "控制风", "地震", "火焰箭矢", "激光眼", "狂暴光环", "风墙"
];

export const MONSTER_TACTICS = [
    "伏击", "制造障碍", "狂暴化", "自我吹捧", "整个吞下", "骚扰", "使残废", "引诱", "保护首领", "横扫",
    "束缚", "致聋", "抓住", "自我保护", "摆动(生物)", "致盲", "欺骗", "袭扰", "拉扯", "摆动(物体)",
    "猛撞", "要求敬拜", "点燃", "推挤", "针对无礼者", "破坏护甲", "缴械", "固定", "翻滚", "针对首领",
    "破坏地形", "使迷向", "跳跃", "打散敌人", "针对最近者", "破坏武器", "分散注意力", "连接", "尖叫", "针对最富有者",
    "推土", "分割敌人", "诱入", "摇晃", "针对最强者", "掘穴", "闪避", "操控", "使患病", "针对最弱者",
    "爆发", "从高处落下", "合并，融合", "猛砸物体", "投掷生物", "同类相食", "效果(参照特定表)", "使陷入泥潭", "旋转", "投掷物体",
    "俘虏", "包围", "独白", "分裂身体", "猛推", "挑战", "纠缠", "谈判", "挤压", "玩弄",
    "吟唱", "规避", "遮蔽", "潜行", "设陷阱", "冲锋", "佯攻", "命令仆从", "怒视", "陷阱效果(参照特定表)",
    "作弊", "侧翼攻击", "钳形攻势", "偷窃", "绊倒", "窒息", "跟随", "装死", "战略性撤退", "破坏(士气/计划)",
    "攀爬", "恐吓", "下毒", "击晕", "呕吐", "迷惑", "围攻", "蓄力", "召唤援军", "猛击"
];

export const MONSTER_WEAKNESSES = [
    "酸液", "疾病", "圣像", "脖子", "皮肤", "酒精", "领域(参照特定表)", "圣油", "噪音", "肥皂",
    "动物(参照特定表)", "耳朵", "圣水", "鼻子", "声音(参照特定表)", "反魔法", "元素(参照特定表)", "冰", "油", "法术(参照特定表)",
    "手臂", "眼睛", "原料(参照特定表)", "命匣", "辛辣食物", "箭矢", "脚", "昆虫", "穿刺伤害", "脊柱",
    "鸟类", "手指", "侮辱", "毒药", "星光", "祝福", "火焰", "铁", "职业(参照特定表)", "阳光",
    "血液", "火光", "腿", "精神伤害", "符号(参照特定表)", "钝击伤害", "鱼类", "闪电", "谜题", "战术(参照特定表)",
    "胸部", "奉承", "地点(参照特定表)", "雨水", "眼泪", "儿童", "花朵", "机械", "圣物", "雷声",
    "教堂钟声", "食物(参照特定表)", "魔法学派(参照特定表)", "谜语", "工具(参照特定表)", "寒冷", "大蒜", "材料(参照特定表)", "仪式", "旅行变动(参照特定表)",
    "颜色(参照特定表)", "礼物", "镜子", "流动的水", "宝藏(参照特定表)", "竞争", "黄金", "杂项物品(参照特定表)", "盐", "真名",
    "交谈", "手", "槲寄生", "气味(参照特定表)", "水", "挥砍伤害", "危险(参照特定表)", "月光", "海水", "武器(参照特定表)",
    "黑暗", "心脏", "嘴巴", "银", "附子草(乌头)", "泥土", "高温", "音乐", "歌唱", "苦艾草"
];
