// 人名随机表：男性名、女性名、姓氏前半、姓氏后半

export const MALE_NAMES = [
    "阿拉里克", "克洛维斯", "弗洛里安", "梅里克", "理查德", "奥尔德斯", "康拉德", "福克斯", "米洛", "罗兰",
    "奥尔顿", "科比特", "伽利略", "莫德雷德", "鲁弗斯", "阿奇博尔德", "克里斯平", "贾尔斯", "莫蒂默", "塞拉斯",
    "阿恩", "塞浦路斯安", "戈弗雷", "内维尔", "斯蒂尔顿", "亚瑟", "赛勒斯", "戈德温", "奥德尔", "斯特拉特福",
    "巴尔萨泽", "戴格尔", "格里姆瓦尔德", "奥格登", "西尔维奥", "巴德", "丹尼斯", "哈姆林", "奥赖恩", "滕皮斯",
    "巴塞洛缪", "德斯特里安", "汉尼拔", "奥尔文", "撒迪厄斯", "巴特莱特", "德罗戈", "希尔德布兰德", "奥斯里克", "托尔斯滕",
    "巴兹尔", "埃尔登", "贾斯帕", "奥斯瓦尔德", "特里斯坦", "巴克斯顿", "埃利斯", "耶利米", "帕斯卡尔", "厄本",
    "本尼迪克特", "埃尔里克", "约翰", "珀西瓦尔", "瓦伦丁", "班尼特", "埃米尔", "朱尔斯", "佩雷格林", "瓦莱里安",
    "比昂", "伊拉斯谟", "肯里克", "皮尔斯", "维吉尔", "伯特伦", "福斯塔斯", "利夫", "昆汀", "沃里克",
    "伯查德", "费利克斯", "利奥波德", "兰道夫", "韦弗利", "卡德曼", "芬恩", "利奥里克", "雷德梅恩", "韦伯斯特",
    "卡斯皮安", "芬尼安", "洛萨", "莱因霍尔德", "威尔金", "查德威克", "菲茨休", "卢西恩", "雷克斯", "怀蒙德"
];

export const FEMALE_NAMES = [
    "阿德莱德", "克莱奥法", "格特鲁德", "利斯贝特", "波比", "艾格尼丝", "克洛蒂尔德", "吉赛尔", "玛德莱娜", "波西亚",
    "阿尔玛", "克洛弗", "戈黛娃", "玛戈特", "罗莎琳德", "阿纳斯塔西娅", "科莱特", "格温娜维尔", "玛丽安", "罗斯",
    "安妮卡", "康斯坦斯", "海洛伊丝", "玛丽戈尔德", "萨宾娜", "安诺拉", "达玛丽斯", "亨丽埃塔", "玛蒂尔达", "西芙",
    "阿斯特丽德", "达芙妮", "海丝特", "梅丽桑德", "西格妮", "芭莎芭", "狄蒙娜", "希波吕忒", "米莉森特", "西格丽德",
    "比阿特丽克斯", "德西蕾", "霍诺拉", "密涅瓦", "赛伦丝", "贝塞尔", "艾拉", "伊莫金", "摩根", "西比尔",
    "比安卡", "埃尔斯贝思", "英格丽德", "内里莎", "塔比莎", "布兰奇", "埃斯梅", "爱奥尼", "奥黛特", "特里尔比",
    "博迪尔", "尤拉莉亚", "艾丽斯", "奥尔加", "乌尔菲尔德", "布里奇特", "尤菲米娅", "伊莎贝塔", "奥利维亚", "厄休拉",
    "布伦希尔德", "艾迪丝", "伊索尔德", "奥奇德", "薇薇安", "卡吕普索", "弗恩", "雅克特", "佩珀", "温蒂",
    "卡特琳娜", "菲奥拉", "让娜", "彼得拉", "威洛", "塞西莉亚", "弗勒尔", "杰萨明", "菲洛梅娜", "薇妮弗雷德",
    "塞莱斯特", "弗洛伦斯", "吉莉", "菲比", "伊薇特", "夏洛特", "弗朗西斯卡", "拉维尼娅", "皮蒂", "佐拉"
];

export const SURNAMES_1 = [
    "阿德-", "查夫-", "弗恩斯-", "朗-", "斯莱瑟-", "艾普-", "查姆-", "福克斯-", "洛夫-", "斯米特-",
    "阿什-", "克洛德-", "甘-", "米德-", "斯诺德-", "巴布-", "科布尔-", "格德-", "马格-", "苏瑟-",
    "巴格-", "科顿-", "戈斯-", "内瑟-", "斯图-", "巴-", "克雷斯-", "格雷-", "内弗-", "斯特-",
    "巴罗-", "克罗姆-", "格里姆-", "奥布林-", "斯温-", "巴斯克-", "坎伯-", "哈夫-", "彭伯-", "塔尔-",
    "博-", "德拉-", "哈德-", "彭宁-", "坦普-", "比特-", "迪格-", "哈罗-", "彭斯-", "泰德-",
    "贝里-", "德劳-", "哈特-", "平克-", "特雷德-", "伯德-", "德雷格-", "哈弗-", "波顿-", "安德-",
    "布兰迪-", "德罗尔-", "海格-", "奎尔-", "范德-", "布莱特-", "邓-", "希瑟-", "拉斯-", "韦瑟-",
    "布林德-", "伊文-", "霍利-", "萨克-", "韦斯特-", "布尔-", "埃弗-", "霍尼-", "萨洛-", "韦克斯-",
    "巴克斯-", "费尔-", "霍恩-", "索尔特-", "惠特-", "卡文-", "法洛-", "凯特-", "斯科-", "威瑟-",
    "切尔滕-", "法辛-", "金斯-", "塞格-", "威辛-", "切斯特-", "费瑟-", "利特-", "西尔弗-", "怀-"
];

export const SURNAMES_2 = [
    "-鲍德", "-克洛斯", "-格林", "-马什", "-滕", "-巴罗", "-科特", "-格罗夫", "-马斯", "-索恩",
    "-巴奇", "-库姆", "-汉姆", "-米尔", "-索普", "-贝克", "-科特(与22同)", "-希尔", "-蒙德", "-思罗普",
    "-布拉德", "-戴尔", "-霍普", "-蒙特", "-顿", "-博尔德", "-迪什", "-莱克", "-莫尔", "-图斯",
    "-伯恩", "-迪奇", "-莱恩", "-莫恩", "-托普", "-博特尔", "-唐", "-兰德", "-尼克", "-文",
    "-博顿", "-法克斯", "-莱斯", "-尼", "-维尔", "-布里奇", "-费尔德", "-林(与51同)", "-波特", "-瓦尔德",
    "-巴克", "-芬特", "-林", "-里奇", "-沃克", "-伯恩(与7同)", "-弗", "-利什", "-罗", "-沃奇",
    "-伯里", "-菲尔德", "-洛克", "-西", "-沃特", "-比", "-富特", "-朗", "-塞特", "-韦尔",
    "-卡斯特", "-福斯", "-洛", "-肖特", "-惠斯尔", "-卡斯尔", "-福特", "-利", "-索普(与83同)", "-威克",
    "-切斯特", "-弗赖", "-曼", "-斯プーン", "-伍德", "-柴尔德", "-盖尔", "-马奇", "-斯塔夫", "-沃姆",
    "-彻奇", "-格拉斯", "-马克", "-斯托克", "-沃思", "-克利夫", "-格雷夫", "-马尔", "-斯通", "-沃西"
];
