export const NPC_IDENTITIES = [
    "修道院院长", "侍僧", "杂技演员", "顾问", "炼金术士", "药剂师", "弓箭手", "重新投骰(原型表)", "工匠", "艺术家",
    "面包师", "乞丐", "铁匠", "装订匠", "酿酒师", "窃贼", "马戏团演员", "木匠", "作曲家", "厨师",
    "伯爵", "朝臣", "扒手", "医生", "捕狗人", "剧作家", "公爵", "伯爵(与21同)", "太监", "刽子手",
    "鹰猎人", "农民", "销赃者", "渔夫", "渔妇", "算命先生", "划桨奴隶", "赌徒", "园丁", "将军",
    "角斗士", "女家庭教师", "掘墓人", "马匹饲养员", "守卫", "草药师", "隐士", "猎人", "旅店老板", "口译员",
    "狱卒", "弄臣，小丑", "珠宝商", "玩杂耍的人", "骑士", "贵妇", "锁匠", "魔法师", "水手", "商人",
    "吟游诗人", "君主", "放债人", "僧侣", "音乐家", "孤儿", "外来者", "亡命之徒", "侍童", "小贩",
    "朝圣者", "偷猎者", "投毒者", "牧师", "王子", "私掠船船员", "捕鼠人", "学者", "抄写员", "佣兵，卖剑者",
    "船长", "店主", "走私者", "士兵", "间谍", "侍从", "学生", "骗子", "裁缝", "酒馆女招待",
    "演员", "盗墓贼", "酷刑者", "捕兽者", "流浪儿", "流浪汉", "子爵", "维齐尔(大臣)", "假发匠", "年轻女士"
];

export const ACTIVITIES = [
    "伏击", "争论", "颁奖", "美化", "玷污", "乞讨", "围攻", "分娩", "祝福", "斗殴",
    "建造", "入室行窃", "埋葬", "露营", "捕捉", "雕刻", "庆祝", "追逐", "清洁", "清理",
    "攀爬", "收集", "竞争", "集会", "烹饪", "求爱", "制作", "诅咒", "跳舞", "污损",
    "防御", "运送", "摧毁", "浇灭", "决斗", "垂死", "进食", "效果(参照特定表)", "逃跑", "护送",
    "挖掘", "处决", "宴飨", "战斗", "逃离", "觅食", "设防", "赌博", "目标(参照特定表)", "守卫",
    "收割", "搬运", "治疗", "躲藏", "点燃", "渗透", "启动仪式", "指导", "绑架", "掠夺",
    "测绘", "结婚", "任务(参照特定表)", "哀悼", "谋杀", "赦免", "交涉", "巡逻", "表演", "计划",
    "种植", "玩耍", "祈祷", "布道", "行进，处理", "质问", "修理", "营救", "休息", "暴动",
    "抢劫", "献祭", "拾荒", "侦察", "搜索", "出售", "歌唱", "睡觉", "声音(参照特定表)", "召唤",
    "投降", "欺诈", "战术(参照特定表)", "照料", "威胁", "追踪", "交易", "训练", "旅行", "敬拜，礼拜"
];

export const NPC_REACTIONS_2D6 = [
    "2 杀死玩家角色",
    "3 伤害或俘虏玩家角色", "3 伤害或俘虏玩家角色",
    "4 骚扰或抢劫玩家角色", "4 骚扰或抢劫玩家角色", "4 骚扰或抢劫玩家角色",
    "5 侮辱、威胁或命令玩家角色", "5 侮辱、威胁或命令玩家角色", "5 侮辱、威胁或命令玩家角色", "5 侮辱、威胁或命令玩家角色",
    "6 避开玩家角色", "6 避开玩家角色", "6 避开玩家角色", "6 避开玩家角色", "6 避开玩家角色",
    "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色",
    "8 跟随或观察玩家角色", "8 跟随或观察玩家角色", "8 跟随或观察玩家角色", "8 跟随或观察玩家角色", "8 跟随或观察玩家角色",
    "9 问候或询问玩家角色", "9 问候或询问玩家角色", "9 问候或询问玩家角色", "9 问候或询问玩家角色",
    "10 与玩家角色分享信息", "10 与玩家角色分享信息", "10 与玩家角色分享信息",
    "11 为玩家角色提供小帮助", "11 为玩家角色提供小帮助",
    "12 请求加入玩家角色队伍"
];

export const FACTIONS = [
    "演员公会", "犯罪家族", "抢劫团伙", "死灵法师", "走私团伙", "天使军团", "狂热邪教徒", "异端教派", "贵族家族", "体育联盟",
    "艺术运动", "辩论社", "最高议会", "军官俱乐部", "运动队", "艺术学校", "恶魔军团", "受雇打手", "神谕者圈子", "间谍网络",
    "刺客公会", "逃兵团伙", "光明会", "外来者氏族", "街头艺术家", "土匪团伙", "龙教", "宗教裁判所", "维和部队", "街头帮派",
    "银行集团", "德鲁伊教团", "骑士团", "哲学俱乐部", "街头音乐家", "野蛮人部落", "地下城探险者公会", "活体机械", "海盗船员", "学生会",
    "吟游诗人公会", "精英战士", "地方警卫队", "偷猎者", "恐怖组织", "乞丐公会", "探险家俱乐部", "疯狂科学家", "社会运动", "盗贼公会",
    "大型猎物猎人", "击剑学校", "商人卡特尔", "政党", "贸易公司", "入室盗窃团伙", "格斗俱乐部", "助产士工会", "游侠小队", "流浪儿群",
    "扫烟囱工", "兄弟会", "民兵组织", "宗教派别", "吸血鬼氏族", "马戏团", "自由佣兵团", "矿业公司", "抵抗组织", "退伍军人协会",
    "市议会", "赌博团伙", "修道院", "王家军队", "义警联盟", "城市卫队", "幽灵协会", "怪物猎人", "王室家族", "术士契约团体",
    "女修道院", "角斗士联盟", "母亲们(组织)", "学者圈子", "狼人族群", "伪造者", "美食家俱乐部", "变种人", "学校教职工", "女巫集会",
    "朝臣派系", "掘墓人", "国家教会", "秘密社团", "巫师学校", "工匠公会", "治疗教团", "海军船员", "下水道居民", "僵尸部落"
];

export const FACTION_TRAITS = [
    "激进的", "纪律严明的", "被追捕的", "令人讨厌的", "目标专一的", "活动(参照特定表)", "分裂的", "近亲繁殖的", "炫耀的", "被诽谤的",
    "老龄化的", "日渐衰落的", "无能的", "爱国的", "势利的", "无政府主义的", "平等主义的", "清廉的", "个性(参照特定表)", "隐秘的(与80同)",
    "古老的", "精英的", "好奇的", "虔诚的", "古板的", "运动型的", "能言善辩的", "疯狂的", "受欢迎的", "颠覆性的",
    "前卫的", "难以捉摸的", "与世隔绝的", "掠夺性的", "被压制的", "背后捅刀的", "反复无常的", "内斗的", "可预测的", "盗窃成性的",
    "破产的", "排外的", "沉溺酒色的", "劝诱改宗的", "受威胁的", "脱离的", "扩张中的", "悠闲的", "骄傲的", "繁荣的",
    "官僚的", "家族式的", "守法的", "受尊敬的", "背叛的", "慈善的", "狂热的", "博学的", "重新统一的", "不死的",
    "有行为准则的", "令人畏惧的", "魔法的", "受崇敬的", "新兴的", "人脉广的", "内部分裂的", "善于操控的", "被唾弃的", "富有的",
    "轻蔑的", "上流社会的", "尚武的", "革命性的", "好客的", "腐败的", "迷人的", "君主制的", "正义的", "武装精良的",
    "打击犯罪的", "遍布全球的", "嗜杀的", "墨守成规的", "补给充足的", "颓废的", "轻信他人的", "音乐的", "无情的", "悲惨的",
    "绝望的", "异端的", "变异的", "斗志昂扬的", "排外的", "歧视性的", "无家可归的", "全国性的", "隐秘的", "年轻的"
];

export const MISSIONS = [
    "逮捕非玩家角色", "摧毁建筑物", "骚扰非玩家角色", "定位地标", "营救领导者", "安排婚姻", "摧毁物品", "隐藏物品", "定位非玩家角色", "营救非玩家角色",
    "唤醒怪物", "摧毁怪物", "隐藏非玩家角色", "定位地点", "解决争端", "驱逐恶魔", "摧毁战团", "羞辱非玩家角色", "掠夺地下城", "取回物品",
    "玷污地点", "使非玩家角色名誉扫地", "冒充非玩家角色", "推翻非玩家角色", "抢劫阵营", "勒索非玩家角色", "淹死非玩家角色", "给阵营留下深刻印象", "巡逻建筑物", "抢劫非玩家角色",
    "贿赂阵营", "复制物品", "给非玩家角色留下印象", "巡逻城市", "破坏物品", "贿赂非玩家角色", "娱乐非玩家角色", "渗透建筑物", "说服阵营", "破坏条约",
    "闯入建筑物", "诱捕非玩家角色", "渗透城市", "说服非玩家角色", "破坏婚礼", "绘制地下城地图", "逃离建筑物", "渗透地下城", "栽赃物品", "勾引非玩家角色",
    "绘制地点地图", "逃离城市", "渗透阵营", "毒害非玩家角色", "走私物品(入)", "清理地下城", "逃离地下城", "调查罪案", "恶搞非玩家角色", "走私物品(出)",
    "清理巢穴", "逃离地点", "绑架领导者", "保护建筑物", "散布谣言", "控制建筑物", "护送非玩家角色", "绑架非玩家角色", "保护物品", "侦察阵营",
    "制作物品", "勒索非玩家角色(与6同)", "杀死领导者", "保护非玩家角色", "侦察非玩家角色", "使非玩家角色残废", "跟踪非玩家角色", "杀死非玩家角色", "追捕非玩家角色", "召唤存在",
    "欺骗阵营", "锻造武器", "定位城市", "突袭建筑物", "通过考验", "欺骗非玩家角色", "陷害非玩家角色", "定位地下城", "替换物品", "驯服怪物",
    "污损建筑物", "恐吓非玩家角色", "定位阵营", "替换非玩家角色", "运送物品", "诈骗非玩家角色", "目标(参照特定表)", "定位物品", "营救家人", "运送非玩家角色"
];

export const REWARDS = [
    "睁一只眼闭一只眼", "工匠", "治疗", "贵族头衔", "社会影响力", "酒水", "密码本", "藏身处", "宫殿", "法术(参照特定表)",
    "动物(参照特定表)", "送货服务", "雇工", "赦免", "香料", "护甲", "地下城(参照特定表)", "猎犬群", "位面传送门", "构筑物(参照特定表)",
    "军队", "地下城地图", "房屋", "政治影响力", "寺庙", "艺术品", "推荐信，认可", "有影响力的盟友", "药水(参照特定表)", "剧院",
    "资产(参照特定表)", "庄园地产", "旅店(参照特定表)", "印刷机", "延长时间", "勒索材料", "专家", "珠宝", "减刑", "塔楼",
    "祝福", "阵营盟友(参照特定表)", "钥匙", "地点地图", "训练", "蓝图", "魔宠", "牲畜", "圣物", "变形",
    "建筑物(参照特定表)", "农场", "地点(参照特定表)", "宗教影响力", "交通工具", "生意，产业", "人情", "机器", "声望", "宝藏(参照特定表)",
    "卡拉维尔帆船", "渔船", "魔法物品", "复仇机会", "藏宝图", "马车", "舰队", "魔法盟友", "权利", "葡萄园",
    "城堡", "锻造厂", "宅邸", "王室服装", "四轮货车", "小教堂", "配方，公式", "材料(参照特定表)", "安全通行", "战团",
    "特许状", "盖伦帆船", "会面机会", "秘密", "战马", "同伴", "黄金", "雇佣兵", "仆人", "富裕服装",
    "合同", "向导", "怪物盟友(参照特定表)", "捷径", "弱点(参照特定表)", "农舍", "公会大厅", "贵族服装", "单桅帆船", "武器(参照特定表)"
];

export const ARCHETYPES = [
    "冒险少年", "愚蠢的暴徒", "傲慢的医生", "爱管闲事的旅店老板", "油滑的律师", "迷糊学者", "前卫的艺术家", "朴素的牧师", "愚笨的伯爵", "昏昏欲睡的狱卒",
    "野心勃勃的新手", "神秘的神谕者", "嬉皮士般的草药师", "老糊涂", "卑鄙的走狗", "动物低语者", "邪恶的巫师", "诚实的劳动者", "过分热情的吟游诗人", "狡猾的骗子",
    "烦人的小鬼", "被流放的政治家", "急躁的决斗者", "可悲的赌徒", "孤独的作曲家", "傲慢的医生(重复)", "堕落的骑士", "理想主义的新兵", "贫困的作家", "刻薄的官僚",
    "朴素的牧师(重复)", "狂热的邪教徒", "易怒的厨师", "虔诚的朝圣者", "精神抖擞的叛逆者", "受爱戴的将军", "无畏的冒险家", "厌倦世故的老兵", "可怜的孤儿", "被宠坏的继承人",
    "直言不讳的农民", "蛇蝎美人", "快活的僧侣", "勇敢的公主", "饥饿的偷猎者", "优雅的交际花", "华丽的裁缝", "博学的贤者", "狂暴的野蛮人", "严厉的军官",
    "冷淡的女家庭教师", "纨绔子弟般的朝臣", "可爱的酒鬼", "轻率的神秘学者", "多疑的间谍", "腐败的守卫", "绅士大盗", "热恋中的青年", "正义的圣骑士", "仗剑游侠",
    "狡猾的太监", "油嘴滑舌的商人", "忠诚的侍从", "流氓般的走私者", "健谈的小贩", "犯罪天才", "爱聊八卦的仆人", "疯狂的发明家", "无情的刺客", "暴虐的领袖",
    "残酷的伯爵", "贪婪的海盗", "忧郁的女王", "饱经风霜的水手", "富有的赞助人", "大胆的探险家", "冷酷的殡仪员", "不合群的异乡人", "挖苦人的小丑", "狂野的德鲁伊",
    "潇洒的诗人", "饱经风霜的游侠", "音乐神童", "衰老的君主", "睿智的巫师", "绝望的土匪", "粗鲁的铁匠", "神秘人物", "宁静的隐士", "衰老的老太婆",
    "伪装的乞丐", "冷硬派侦探", "自恋的演员", "沉默的刽子手", "精疲力尽的拳击手", "顽强的战士", "忙碌的学生", "高贵的王子", "阴险的维齐尔", "狂热的审判官"
];

export const PERSONALITIES = [
    "总是无聊", "风度翩翩的", "可敬的", "天真的", "讽刺的", "焦虑的", "颓废的", "急躁的", "自恋的", "自怨自艾的",
    "原型(参照特定表)", "傻乎乎的", "缺乏幽默感的", "书呆子", "平静的", "傲慢的", "教条的", "理想主义的", "永不放弃的", "怀疑的",
    "直言不讳的", "滑稽的", "专横的", "偏执的", "懒散的", "专横的", "享乐主义的", "冲动的", "过分谨慎的", "邋遢的",
    "吹牛的", "狂热的", "缺乏安全感的", "多疑的(与65同)", "爱打小报告的", "霸道的", "蛇蝎美人型的", "激烈的", "爱国的", "势利的",
    "积极肯干的", "极度忠诚的", "嫉妒的", "学究气的", "诡辩的", "喋喋不休的", "华丽的", "混蛋", "完美礼仪的", "心不在焉的",
    "愉快的", "轻浮的", "笨手笨脚的", "完美主义的", "迷信的", "友好的", "通俗的", "万事通", "虔诚的", "记忆力差的",
    "好胜的", "正式的", "认识所有人", "渴望权力的", "迟钝的", "习惯性说谎的", "慷慨的", "逻辑性强的", "有偏见的", "谄媚的",
    "居高临下的", "有洁癖的", "痴情的", "易怒的", "完全不可靠的", "诡计多端的", "贪吃的", "狂躁的", "劝诱改宗的", "诚实的",
    "勇敢的", "爱聊八卦的", "忧郁的", "正义的", "紧张的，拘谨的", "懦弱的", "轻信他人的", "厌世的", "纪律严明的", "爱抱怨的",
    "令人毛骨悚然的", "冷硬派的", "吝啬的", "无情的", "夸夸其谈的", "神秘的", "记仇的", "病态的", "虐待狂", "爱说俏皮话的"
];

export const NPC_DETAILS = [
    "酸液疤痕", "孩子气的脸", "听力不佳", "童花头", "头发光滑向后梳", "鹰钩鼻", "轮廓分明的脸", "魁梧的", "完美的姿势", "没精打采的",
    "箭伤疤痕", "爪伤疤痕", "瘦长的", "喷香水的", "有体味的", "运动型身材", "精心打理的发型", "下巴突出", "有穿孔", "方脸(与13同)",
    "视力差", "肥胖的", "跛脚", "脸型尖削", "眯着眼", "秃头", "脸型崎岖", "脸型臃肿", "马尾辫", "身材匀称的",
    "开始秃顶", "牙齿歪斜", "头发华丽", "天花疤痕", "矮壮的", "美丽的", "短发", "缺一只胳膊", "肌肉发达的", "爱出汗的",
    "胎记", "卷发", "缺一只耳朵", "仪式疤痕", "有纹身的", "咬痕", "失聪", "缺一只眼睛", "脸色红润", "矮小的",
    "刀疤", "脸型精致", "缺一根手指", "牙齿腐烂", "丸子头", "失明", "脏辫", "缺一只脚", "圆脸", "高耸的",
    "脸型方正", "头发肮脏", "缺一只手", "粗犷的", "嘴唇歪斜", "骨瘦如柴的", "松弛的", "缺一条腿", "瘦弱的", "头发很长",
    "编辫子的头发", "脸型扁平", "缺牙", "头发蓬乱", "满是疣子", "强壮的", "虚弱的", "突变(参照特定表)", "牙齿锋利", "波浪卷发",
    "头发硬直", "雀斑", "哑巴", "枯萎的", "饱经风霜的脸", "鼻子断裂", "满脸皱纹", "没有眉毛", "丝滑的头发", "纤细的",
    "烧伤疤痕", "憔悴的", "绞索疤痕", "肌肉结实的", "精瘦的", "浓密的眉毛", "金牙", "油腻的", "苗条的", "头发稀疏的"
];

export const GOALS = [
    "达到神圣境界", "控制贸易", "摧毁魔法", "复仇", "出版著作", "获得追随者", "创建军队", "摧毁贵族", "打听谣言", "清除叛徒",
    "获得土地", "创作艺术", "摧毁王国", "沉溺于个人品味", "复活死者", "获得财富", "创建基地", "摧毁宗教", "加入阵营", "恢复阵营",
    "辅佐领导者", "创建城市", "摧毁世界", "加入贵族行列", "恢复统治者", "震惊全城", "制造疾病", "使阵营名誉扫地", "领导阵营", "统治城市",
    "避免被发现", "创建地下城", "分配财富", "绘制荒野地图", "统治王国", "获得自由", "创建阵营", "终结贫困", "精通技能", "统治世界",
    "变得臭名昭著", "组建家庭", "终结战争", "任务(参照特定表)", "破坏阵营", "变得博学", "制造机器", "执行法律", "推翻统治者", "看世界",
    "清理地区", "建立垄断", "强制推行道德", "平定阵营", "服务神祇", "收集古物", "创造怪物", "启蒙，顿悟", "保护古物", "服务邪恶",
    "征服城市", "创建传送门", "娱乐", "保护边界", "服务阵营", "征服地区", "削弱阵营", "名誉与荣耀", "保护城市", "服务领导者",
    "控制城市", "治愈疾病", "寻求正义", "保护阵营", "服务有需要的人", "控制阵营", "摧毁军队", "寻找爱情", "保护家人", "分享知识",
    "控制魔法", "摧毁古物", "陷害阵营", "保护历史", "屠杀怪物", "控制军队", "摧毁城市", "恐吓城市", "保护领导者", "播种混乱",
    "控制政治", "摧毁阵营", "恐吓阵营", "保护地区", "传播信仰", "控制宗教", "摧毁家庭", "获得尊重", "保护弱者", "在危险中生存"
];
