export const NPC_IDENTITIES = [
    "修道院院长", "侍僧", "杂技演员", "顾问", "炼金术士", "药剂师", "弓箭手", "重新投骰(原型表)", "工匠", "艺术家",
    "面包师", "乞丐", "铁匠", "装订匠", "酿酒师", "窃贼", "马戏团演员", "木匠", "作曲家", "厨师",
    "伯爵", "朝臣", "扒手", "医生", "捕狗人", "剧作家", "公爵", "伯爵(与21同)", "太监", "刽子手",
    "鹰猎人", "农民", "销赃者", "渔夫", "渔妇", "算命先生", "划桨奴隶", "赌徒", "园丁", "将军",
    "角斗士", "女家庭教师", "掘墓人", "马匹饲养员", "守卫", "草药师", "隐士", "猎人", "旅店老板", "口译员",
    "狱卒", "弄臣，小丑", "珠宝商", "玩杂耍的人", "骑士", "贵妇", "锁匠", "魔法师", "水手", "商人",
    "吟游诗人", "君主", "放债人", "僧侣", "音乐家", "孤儿", "外来者", "亡命之徒", "侍童", "小贩",
    "朝圣者", "偷猎者", "投毒者", "牧师", "王子", "私掠船船员", "捕鼠人", "学者", "抄写员", "佣兵，卖剑者",
    "船长", "店主", "走私者", "士兵", "间谍", "侍从", "学生", "骗子", "裁缝", "酒馆女招待",
    "演员", "盗墓贼", "酷刑者", "捕兽者", "流浪儿", "流浪汉", "子爵", "维齐尔(大臣)", "假发匠", "年轻女士"
];
