export const NPC_IDENTITIES = [
    "修道院院长", "侍僧", "杂技演员", "顾问", "炼金术士", "药剂师", "弓箭手", "重新投骰(原型表)", "工匠", "艺术家",
    "面包师", "乞丐", "铁匠", "装订匠", "酿酒师", "窃贼", "马戏团演员", "木匠", "作曲家", "厨师",
    "伯爵", "朝臣", "扒手", "医生", "捕狗人", "剧作家", "公爵", "伯爵(与21同)", "太监", "刽子手",
    "鹰猎人", "农民", "销赃者", "渔夫", "渔妇", "算命先生", "划桨奴隶", "赌徒", "园丁", "将军",
    "角斗士", "女家庭教师", "掘墓人", "马匹饲养员", "守卫", "草药师", "隐士", "猎人", "旅店老板", "口译员",
    "狱卒", "弄臣，小丑", "珠宝商", "玩杂耍的人", "骑士", "贵妇", "锁匠", "魔法师", "水手", "商人",
    "吟游诗人", "君主", "放债人", "僧侣", "音乐家", "孤儿", "外来者", "亡命之徒", "侍童", "小贩",
    "朝圣者", "偷猎者", "投毒者", "牧师", "王子", "私掠船船员", "捕鼠人", "学者", "抄写员", "佣兵，卖剑者",
    "船长", "店主", "走私者", "士兵", "间谍", "侍从", "学生", "骗子", "裁缝", "酒馆女招待",
    "演员", "盗墓贼", "酷刑者", "捕兽者", "流浪儿", "流浪汉", "子爵", "维齐尔(大臣)", "假发匠", "年轻女士"
];

export const ACTIVITIES = [
    "伏击", "争论", "颁奖", "美化", "玷污", "乞讨", "围攻", "分娩", "祝福", "斗殴",
    "建造", "入室行窃", "埋葬", "露营", "捕捉", "雕刻", "庆祝", "追逐", "清洁", "清理",
    "攀爬", "收集", "竞争", "集会", "烹饪", "求爱", "制作", "诅咒", "跳舞", "污损",
    "防御", "运送", "摧毁", "浇灭", "决斗", "垂死", "进食", "效果(参照特定表)", "逃跑", "护送",
    "挖掘", "处决", "宴飨", "战斗", "逃离", "觅食", "设防", "赌博", "目标(参照特定表)", "守卫",
    "收割", "搬运", "治疗", "躲藏", "点燃", "渗透", "启动仪式", "指导", "绑架", "掠夺",
    "测绘", "结婚", "任务(参照特定表)", "哀悼", "谋杀", "赦免", "交涉", "巡逻", "表演", "计划",
    "种植", "玩耍", "祈祷", "布道", "行进，处理", "质问", "修理", "营救", "休息", "暴动",
    "抢劫", "献祭", "拾荒", "侦察", "搜索", "出售", "歌唱", "睡觉", "声音(参照特定表)", "召唤",
    "投降", "欺诈", "战术(参照特定表)", "照料", "威胁", "追踪", "交易", "训练", "旅行", "敬拜，礼拜"
];

export const NPC_REACTIONS_2D6 = [
    "2 杀死玩家角色",
    "3 伤害或俘虏玩家角色", "3 伤害或俘虏玩家角色",
    "4 骚扰或抢劫玩家角色", "4 骚扰或抢劫玩家角色", "4 骚扰或抢劫玩家角色",
    "5 侮辱、威胁或命令玩家角色", "5 侮辱、威胁或命令玩家角色", "5 侮辱、威胁或命令玩家角色", "5 侮辱、威胁或命令玩家角色",
    "6 避开玩家角色", "6 避开玩家角色", "6 避开玩家角色", "6 避开玩家角色", "6 避开玩家角色",
    "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色", "7 忽略玩家角色",
    "8 跟随或观察玩家角色", "8 跟随或观察玩家角色", "8 跟随或观察玩家角色", "8 跟随或观察玩家角色", "8 跟随或观察玩家角色",
    "9 问候或询问玩家角色", "9 问候或询问玩家角色", "9 问候或询问玩家角色", "9 问候或询问玩家角色",
    "10 与玩家角色分享信息", "10 与玩家角色分享信息", "10 与玩家角色分享信息",
    "11 为玩家角色提供小帮助", "11 为玩家角色提供小帮助",
    "12 请求加入玩家角色队伍"
];
