export const MAGIC_RULES = {
    intro: "任何9级以内的老派RPG的法术列表都完美兼容《恶棍》。网络上有很多免费的经典法术列表。以下是100个无等级法术示例。「L」代表施法者等级。物品是能用一只手举起的物体，而物体是至多人类大小的任何东西。除非另有说明，所有效果持续的法术的持续时间为 L×10分钟，射程最多40'。",
    casting: "在《恶棍》中，PC只能施放其等级以下的法术，所以3级PC只能施放0–3级的法术（如果使用有等级法术规则）。施放法术得用魔典，需要双手持握大声念诵。每本魔典每天只能用一次。重要的是，每本魔典只有一道法术，并且每本魔典占据1个物品栏位。所以若某名PC想施展丰富多样的法术，就必须在行装里塞满魔典。",
    grimoires: "PC无法创造、复制或抄录魔典。PC要获取新法术都必须为之冒险（搜寻地城或是从魔法师处夺得）。魔典的等级越高，也就越为稀有珍贵。为之垂涎的盗匪和法师可能会紧咬着公开携带高级魔典的PC不放。",
    saves: "当某道法术允许豁免，就用智力豁免对抗防御方的相关属性，通常如下：灵巧对抗远程攻击法术，体质对抗生命流失法术，智力对抗心灵改变法术。"
};
